// ####################################################################################################################################
// OZON CONFIG
// ####################################################################################################################################

//https://dev.ozon.ru/news/513-Seller-API-ubiraem-ustarevshie-parametry

/**
 * @type {Spreadsheet}
 */
const ss = SpreadsheetApp.getActiveSpreadsheet();

var context = {
  debug: false,
  requestLog: false,
  configLog: false,
  check: false,
  owner: ss.getOwner()?.getEmail(),
  access: {
    uuid: undefined,
    url: undefined,
  },
  triggerRange: undefined,
  scriptRange: undefined,
  spreadsheetId: ss.getId(),
  service: undefined,
  serviceName: "Ozon",
  serviceType: "getScriptProperties",
  storage: undefined,
  config: undefined,
  this_: undefined,
};

// Глобальный кэш для метаданных таблиц в Google Apps Script
if (typeof globalMetadataCache === "undefined") {
  var globalMetadataCache = {};
}

var CONFIG = (function () {
  return {
    settings: {
      libraryVersion: "317 от 12.01.2026",
      libraryVersionRange: "C3",
      sheetSettings: "⚙️ Поддержка",
      sheetSheetsOrder: "Настройка листов",
      mail: PropertiesService.getScriptProperties().getProperties().OWNER_EMAIL,
      scriptRows: {
        fboPostingList: 7,
        fbsPostingList: 8,
        financeTransactionListLoadGrupped: 9,
        financeRealizations: 10,
        reportPostingsFbo: 11,
        reportPostingsFbs: 12,
        reportDiscounted: 13,
        fboFbsReturnsList: 14,
        reportReturns: 15,
        rfbsReturns: 16,
        reportCashFlowStatement: 17,
        reportCashFlowStatementWithDetails: 18,
        reportProducts: 19,
        stocksAll: 20,
        analyticsStockOnWarehousesReport: 21,
        analyticsStocks: 22,
        analyticsTurnoverStocksReport: 23,
        prices: 24,
        pricesFull: 25,
        analyticsDataReport: 26,
        pfCampaigns: 27,
        pfExpense: 28,
        pfDaily: 29,
        pfSkuProduct: 30,
        pfSearchPromoOrders: 31,
        pfSearchPromoProducts: 32,
        pfStatSku: 33,
        pfStatSearchPromo: 34,
        pfStatBanners: 35,
        pfStatVideoBanners: 36,
        pfStatBrendSelf: 37,
      },
      time: {
        timeZone: "Europe/Moscow",
        now: new Date(),
        options: {
          year: "numeric",
          month: "numeric",
          day: "numeric",
        },
      },
      log: {
        id: PropertiesService.getScriptProperties().getProperties().LOG_SS_ID,
        sheet: "LOG Ozon",
        sheetColor: "GREEN",
        head: [
          "DateTime",
          "UserEmail",
          "Spredsheet",
          "Function",
          "Milliseconds",
          "Minutes",
          "Error",
          "libraryVersion",
        ],
      },
    },
    formats: {
      general: "General",
      text: "@",
      number: "0.00",
      number_short: "0",
      number_space: "#,##0.00",
      percentages: "0.00%",
      rub: "#,##0.00[$ ₽]",
      datehhmm: "dd.MM.yyyy H:mm",
      datehhmmss: "dd.MM.yyyy H:mm:ss",
      date: "dd.MM.yyyy",
      dateyyy_mm_dd: "yyyy-MM-dd",
      dateyyy_mm_ddhhmmss: "yyyy-mm-dd H:mm:ss",
    },
    base: {
      sheets: {
        orders: "К сборке",
        done: "Готовые",
        done3: "Все готовые",
        mark: "Маркировка",
        doneMark: "Done мark",
        labels: "Этикетки",
        act: "Акт",
        updateStocks: "Обновить остатки",
        prices: "Цены",
        stocks: "Остатки",
      },
      sheetColor: "#00ff00",
      formulas: {
        mark: `={"Короткая";ArrayFormula(IF(INDIRECT("B2:B")="";; MID(INDIRECT("B2:B");1;24)))}`,
        doneMark: `={"Done";ArrayFormula(IF(INDIRECT("A2:A")="";;IFERROR(IF(VLOOKUP(INDIRECT("A2:A");'Done мark'!$D:$D;1;0)=INDIRECT("A2:A");TRUE;FALSE);FALSE)))}`,
      },
      labelsRanges: {
        numRowAfterHead: 2,
        colValue: "C",
        colPaste: "G",
      },
    },
    methods: {
      seller: {
        fbo: {
          sheetColor: "#41ff00",
          postingList: {
            sheet: "Список отправлений FBO",
            range: "A1:AF",
            sheetColor: "#41ff00",
            status: {
              awaiting_packaging: "Ожидает упаковки",
              awaiting_deliver: "Ожидает отгрузки",
              delivering: "Доставляется",
              delivered: "Доставлено",
              cancelled: "Отменено",
            },
            deliveryType: {
              PVZ: "ПВЗ",
              Courier: "Курьер",
              PickPoint: "Постамат",
              Post: "Post",
            },
            full: {
              datesRanges: ["C:D"],
              generalRanges: ["I:AB"],
              numberShortRanges: ["Q:Q"],
              header: [
                // "ID заказа",
                "Номер заказа",
                "Номер отправления",
                "Дата начала обработки отправления",
                "Дата создания отправления",
                "Статус отправления",

                // "additional_data",
                "Ozon SKU id",
                "Артикул",
                "Название",
                "Кол-во товаров",
                "Цена товара",
                "Сумма",
                // "Коды активации для услуг и цифровых товаров",
                "Валюта цен",
                "Кластер отгрузки",
                "Кластер доставки",
                "Город доставки (для продавцов из СНГ)",
                "Способ доставки",
                "ID склада",
                "Название склада отправки заказа",
                "Способ оплаты",
                "Наличие подписки Premium",
                "Юр. лицо",
                // "Ozon id",
                "Размер комиссии за товар",
                "Процент комиссии",
                "Выплата продавцу",
                // "Валюта цен",
                "Цена до учёта скидок (в карточке зачёркнутая)",
                "Цена товара с учётом скидок (показывается в карточке)",
                "Сумма скидки",
                "Процент скидки",
                "Акции",
                // "Стоимость доставки",
                // "Дата доставки",
                // "Крупногабаритный товар или нет",
                // "Количество товара в отправлении",
                // "ID причины отмены отправления",
                "Причина отмены",
                "Инициатор отмены",
              ],
            },
          },
          cancelReasonList: {
            sheet: "Причины отмены отправлений FBO",
            sheetColor: "#41ff00",
            rangeDate: ["A:A"],
            type: {
              buyer: "Покупатель",
              seller: "Продавец",
              client: "Покупатель",
              customer: "Покупатель",
              ozon: "Ozon",
              system: "Отменено системой",
              delivery: "Служба доставки",
            },
            header: {
              updated: "Обновлено",
              id: "ID причины отмены",
              title: "Название категории",
              type_id: "Инициатор отмены",
              is_available_for_cancellation: "Запрос доступен для отмены",
            },
          },
        },
        fbs: {
          sheetColor: "#ff6700",
          statuses: {
            acceptance_in_progress: "Идёт приёмка",
            arbitration: "Арбитраж",
            awaiting_approve: "Ожидает подтверждения",
            awaiting_deliver: "Ожидает отгрузки",
            awaiting_packaging: "Ожидает упаковки",
            awaiting_registration: "Ожидает регистрации",
            awaiting_verification: "Создано",
            cancelled: "Отменено",
            cancelled_from_split_pending:
              "Отменён из-за разделения отправления",
            client_arbitration: "Клиентский арбитраж доставки",
            delivering: "Доставляется",
            driver_pickup: "У водителя",
            not_accepted: "Не принят на сортировочном центре",
            delivered: "Доставлено",
            sent_by_seller: "Отправлено продавцом",
          },
          unfulfilledList: {
            sheet: "К сборке",
            range: "A1:N",
            pasteRanges: ["D:E", "N2:N", "O2:O", "H1"],
            sheetColor: "#ff6700",
            header: [
              "Номер заказа",
              "Номер отправления",
              "Статус",
              "Принят в обработку",
              "Собрать до",
              "Ozon SKU id",
              "Артикул",
              "Маркировка",
              "Название",
              "Кол-во",
              "Цена",
              "Сумма",
              "Штрих-код",
              "Собрать",
              "Разделить и собрать",
              "Номер таможенной декларации (ГТД)",
              "Страна изготовитель",
              "Маркировка «Честный ЗНАК»",
              "Регистрационный номер партии товара (РНПТ)",
              "Добавить страну",
              "Добавить ГТД",
            ],
            formula: `={"Маркировка";INDEX(IFERROR(VLOOKUP(ROW(I2:I)&I2:I;TMP!A:E;5;0)))}`,
            status: "awaiting_packaging",
            statuses: {
              awaiting_registration: "Ожидает регистрации",
              acceptance_in_progress: "Идёт приёмка",
              awaiting_approve: "Ожидает подтверждения",
              awaiting_packaging: "Ожидает упаковки",
              awaiting_deliver: "Ожидает отгрузки",
              arbitration: "Арбитраж",
              client_arbitration: "Клиентский арбитраж доставки",
              delivering: "Доставляется",
              driver_pickup: "У водителя",
              delivered: "Доставлено",
              not_accepted: "Не принят на сортировочном центре",
              cancelled: "Отменено",
              sent_by_seller: "Отправлено продавцом",
            },
          },
          postingList: {
            sheet: "Список отправлений FBS",
            range: "A1:T",
            sheetColor: "#ff6700",
            status: {
              acceptance_in_progress: "Идёт приёмка",
              arbitration: "Арбитраж",
              awaiting_approve: "Ожидает подтверждения",
              awaiting_deliver: "Ожидает отгрузки",
              awaiting_packaging: "Ожидает упаковки",
              awaiting_registration: "Ожидает регистрации",
              awaiting_verification: "Создано",
              cancelled: "Отменено",
              cancelled_from_split_pending:
                "Отменено из-за разделения отправления",
              client_arbitration: "Клиентский арбитраж доставки",
              delivering: "Доставляется",
              driver_pickup: "У водителя",
              not_accepted: "Не принят на сортировочном центре",
              delivered: "Доставлено",
              sent_by_seller: "Отправлено продавцом",
            },
            substatus: {
              posting_acceptance_in_progress: "Идёт приёмка",
              posting_in_arbitration: "Арбитраж",
              posting_created: "Создано",
              posting_in_carriage: "В перевозке",
              posting_not_in_carriage: "Не добавлено в перевозку",
              posting_registered: "Зарегистрировано",
              posting_awaiting_passport_data: "Ожидает паспортных данны",
              posting_created: "Создано",
              posting_awaiting_registration: "Ожидает регистрации",
              posting_registration_error: "Ошибка регистрации",
              posting_split_pending: "Создано",
              posting_canceled: "Отменено",
              posting_in_client_arbitration: "Клиентский арбитраж доставки",
              posting_delivered: "Доставлено",
              posting_received: "Получено",
              posting_conditionally_delivered: "Условно доставлено",
              posting_in_courier_service: "Курьер в пути",
              posting_in_pickup_point: "В пункте выдачи",
              posting_on_way_to_city: "В пути в ваш город",
              posting_on_way_to_pickup_point: "В пути в пункт выдачи",
              posting_returned_to_warehouse: "Возвращено на склад",
              posting_transferred_to_courier_service:
                "Передаётся в службу доставки",
              posting_driver_pick_up: "У водителя",
              posting_not_in_sort_center: "Не принято на сортировочном центре",
              sent_by_seller: "Отправлено продавцом",
              posting_transferring_to_delivery_courier:
                "Передаётся курьеру / в доставку",
              // posting_transferring_to_delivery (status=awaiting_deliver) — передаётся в доставку,
              // posting_transferring_to_delivery (status=awaiting_registration) — передаётся курьеру,
            },
            prrOption: {
              lift: "Подъём на лифте",
              stairs: "Подъём по лестнице",
              none: "Отказался от услуги",
              delivery_default: "Доставка на этаж, (включена в стоимость)",
            },
            deliveryType: {
              PVZ: "ПВЗ",
              Courier: "Курьер",
              PickPoint: "Постамат",
              Post: "Post",
            },
            tplIntegrationType: {
              ozon: "Службой Ozon",
              "3pl_tracking": "Интегрированной службой",
              non_integrated: "Сторонней службой",
              aggregator: "Партнёрская доставка Ozon",
              hybryd: "Почта России",
            },
            full: {
              datesRanges: ["C:E", "V:W"],
              generalRanges: ["M:AM"],
              numberShortRanges: ["Z:Z"],
              header: [
                // "ID заказа",
                "Номер заказа",
                "Номер отправления",
                "Принят в обработку",
                "Дата отгрузки",
                "Дата доставки",
                "Статус",
                "Подстатус",
                "Верхний штрихкод",
                "Нижний штрихкод",
                "Ozon SKU id",
                "Артикул",
                "Название",
                "Кол-во товаров",
                "Цена товара",
                "Сумма",
                "Валюта цен",
                "Кластер отгрузки",
                "Кластер доставки",
                // "Номер родительского отправления",
                // "Трек-номер отправления",
                // "Тип интеграции со службой доставки",
                // "Код услуги погрузочно-разгрузочных работ",
                // "Ozon Express",
                // "Eсть многокоробочный товар",
                // "Кол-во коробок, в которые упакован товар",
                // "ID способа доставки",
                // "Название способа доставки",
                // "ID склада",
                // "Название склада",
                // "ID службы доставки",
                // "Служба доставки",
                // "Список (SKU id), нужно передать ГТД",
                // "Список (SKU id), нужно передать информацию о стране-изготовителе",
                // "Список (SKU id), нужно передать маркировку «Честный ЗНАК»",
                // "Список (SKU id), нужно передать УИН",
                // "Список (SKU id), нужно передать РНПТ",
                // "Имя покупателя",
                // "Телефон покупателя",
                // "Идентификатор покупателя",
                // "Имя покупателя",
                // "Контактный телефон",
                // "Адрес в текстовом формате",
                // "Город доставки",
                // "Комментарий к заказу",
                // "Страна доставки",
                // "Район доставки",
                // "Широта",
                // "Долгота",
                // "Код ПВЗ 3PL провайдера",
                // "Код ПВЗ",
                // "Регион доставки",
                // "Почтовый индекс получателя",
                "Регион доставки (для rFBS)",
                "Город доставки (для rFBS)",
                "Способ доставки",
                "Дата и время начала доставки",
                "Дата и время конца доставки",
                "ID службы доставки",
                "Служба доставки",
                "ID склада отгрузки",
                "Склад отгрузки",
                "Способ оплаты",
                "Наличие подписки Premium",
                "Юр. лицо",
                // "Ozon id",
                "Размер комиссии за товар",
                "Процент комиссии",
                "Выплата продавцу",
                // "Валюта цен",
                "Цена до учёта скидок (в карточке зачёркнутая)",
                "Цена товара с учётом скидок (показывается в карточке)",
                "Сумма скидки",
                "Процент скидки",
                "Акции",

                // "ID причины отмены",
                "Причина отмены",
                // "Тип отмены",
                // "Отмена после сборки",
                // "Отмена влияет на рейтинг",
                "Инициатор отмены",
                "ID эконом-товара",
              ],
            },
            assembly: {
              sheet: "К сборке",
              range: "A1:N",
              pasteRanges: ["D:E", "N2:N", "O2:O", "H1"],
              sheetColor: "#ff6700",
              header: [
                "Номер заказа",
                "Номер отправления",
                "Статус",
                "Принят в обработку",
                "Собрать до",
                "Ozon SKU id",
                "Артикул",
                "Маркировка", // @depricated
                "Название",
                "Кол-во",
                "Цена",
                "Сумма",
                "Штрих-код",
                "Собрать",
                "НЕ НАЖИМАТЬ!!! Разделить и собрать",
                "Номер таможенной декларации (ГТД)",
                "Страна изготовитель",
                "Маркировка «Честный ЗНАК»",
                "Регистрационный номер партии товара (РНПТ)",
                "Добавить страну",
                "Добавить ГТД",
              ],
              formula: `={"Маркировка";INDEX(IFERROR(VLOOKUP(ROW(I2:I)&I2:I;TMP!A:E;5;0)))}`,
              status: "awaiting_packaging",
              statuses: {
                awaiting_registration: "Ожидает регистрации",
                acceptance_in_progress: "Идёт приёмка",
                awaiting_approve: "Ожидает подтверждения",
                awaiting_packaging: "Ожидает упаковки",
                awaiting_deliver: "Ожидает отгрузки",
                arbitration: "Арбитраж",
                client_arbitration: "Клиентский арбитраж доставки",
                delivering: "Доставляется",
                driver_pickup: "У водителя",
                delivered: "Доставлено",
                not_accepted: "Не принят на сортировочном центре",
                cancelled: "Отменено",
                sent_by_seller: "Отправлено продавцом",
              },
            },
            new: {
              sheet: "К сборке",
              range: "A1:T",
              pasteRanges: ["D:E"],
              sheetColor: "RED",
              header: [
                "Номер заказа",
                "Номер отправления",
                "Статус",
                "Принят в обработку",
                "Собрать до",
                "В доставку",
                "Ozon SKU id",
                "Артикул",
                "Маркировка", // @depricated
                "Название",
                "Кол-во",
                "Цена",
                "Сумма",
                "Верхний штрих-код",
                "Нижний штрих-код",
              ],
            },
            done: {
              sheet: "Готовые",
              range: "A1:F",
              pasteRanges: ["C:C"],
              insertCheckboxRange: ["H2:H"],
              sheetColor: "#ff0000",
              header: [
                "Номер заказа",
                "Номер отправления",
                "Собрать до",
                "Ozon SKU id",
                "Маркировка", // @depricated
                "Артикул",
                "Название",
                "На печать",
                "Порядок этикеток",
                "Этикетки",
                "Номер таможенной декларации (ГТД)",
                "Страна изготовитель",
                "Маркировка «Честный ЗНАК»",
                "Рег. номер партии товара (РНПТ)",
              ],
              status: "awaiting_deliver",
            },
            doneAll: {
              sheet: "Все готовые",
              range: "A1:O",
              pasteRanges: ["D:E"],
              sheetColor: "#ff0000",
              header: [
                "Номер заказа",
                "Номер отправления",
                "Статус",
                "Принят в обработку",
                "Собрать до",
                "В доставку",
                "Ozon SKU id",
                "Артикул",
                "Маркировка", // @depricated
                "Название",
                "Кол-во",
                "Цена",
                "Сумма",
                "Верхний штрих-код",
                "Нижний штрих-код",
              ],
            },
          },
          cancelReasonList: {
            sheet: "Причины отмены отправлений FBS",
            sheetColor: "#41ff00",
            rangeDate: ["A:A"],
            type: {
              buyer: "Покупатель",
              seller: "Продавец",
              client: "Покупатель",
              customer: "Покупатель",
              ozon: "Ozon",
              system: "Отменено системой",
              delivery: "Служба доставки",
            },
            header: {
              updated_at: "Обновлено",
              id: "ID причины отмены",
              title: "Название категории",
              type_id: "Инициатор отмены",
              is_available_for_cancellation: "Запрос доступен для отмены",
            },
          },
        },
        supply: {
          range: "A1:AZZ",
          sheetColor: "#41ff00",
          count: {
            sheet: "Список заявок по статусам",
            dateRange: ["A:A"],
            header: {
              updated_at: "Обновлено",
              state: "Статус поставки",
              count: "Количество заявок",
            },
          },
          info: {
            sheet: "Информация о заявке на поставку",
            dateRange: ["B:B"],
            dateTimeRange: ["A:A", "C:C", "H:I", "P:P"],
            numberRange: ["D:E", "K:K", "N:N", "Q:Q", "Y:Z"],
            header: {
              updated_at: "Дата и вермя выгрузки",

              created_date: "Дата создания заявки на поставку",
              state_updated_date: "Дата обновления статуса заявки на поставку",
              order_id: "ID заявки на поставку",
              order_number: "Номер заявки на поставку",
              order_state: "Статус заявки на поставку",
              data_filling_deadline:
                "Время в секундах, оставшееся на заполнение данных по поставке (для заявок с вРЦ)",
              timeslot_from: "Начало интервала поставки по местному времени",
              timeslot_to: "Конец интервала поставки по местному времени",
              timeZone: "Название часового пояса",
              supply_id: "ID поставки",
              supply_state: "Статус поставки",
              bundle_id: "ID состава поставки",

              storage_warehouse_warehouse_id: "ID склада хранения",
              storage_warehouse_name: "Название склада хранения",
              storage_warehouse_arrival_date: "Дата прибытия на склад хранения",

              drop_off_warehouse_id: "ID пункта отгрузки",
              drop_off_warehouse_name: "Название пункта отгрузки",

              order_tags_is_super_fbo: "Продавец подключён к Super-поставкам",
              order_tags_product_super_fbo:
                "Заявка на поставку относится к Super-товарам",
              order_tags_is_quant: "В поставке есть кванты",
              order_tags_is_econom:
                "Заявка на поставку относится к товарам «Суперэконом»",
              order_tags_is_virtual: "Заявка на поставку виртуальная",

              order_tags_is_pickup: "order_tags_is_pickup",
              order_tags_seller_warehouse_id: "order_tags_seller_warehouse_id",
              order_tags_original_supply_id: "ID исходной поставки",

              supply_tags_freeze_stock_for_marking:
                "Включена схема поставки товаров с заморозкой стока",
              supply_tags_is_ettn_required: "Нужна электронная ТТН",
              supply_tags_is_evsd_required:
                "Есть товары с сертификацией в системе «Меркурий»",
              supply_tags_is_jewelry: "Есть ювелирные товар",
              supply_tags_is_marking_possible:
                "Есть товары, для которых возможна маркировка",
              supply_tags_is_marking_required:
                "Есть товары, для которых маркировка обязательна",
              supply_tags_is_utd: "Нужно передать УПД",
              is_crossdock: "Поставка кросс-докинг",
            },
          },
          bundle: {
            sheet: "Состав поставки или заявки на поставку",
            header: {
              supply_id: "ID заявки на поставку",
              bundle_id: "ID состава поставки",
              product_id: "Ozon id",
              sku: "Ozon SKU id",
              offer_id: "Артикул",
              barcode: "Штрихкод товара",
              name: "Название",
              quantity: "Кол-во",
              quant: "Кол-во в одной уп.",
              is_quant_editable: "Можно изменить кол-во товаров в одной уп.",
              volume_in_litres: "Объём товара в л.",
              total_volume_in_litres: "Объём всех товаров в л.",
              sfbo_attribute: "Метка Super-товара",
              shipment_type: "Тип упаковки",
              tags: "Теги товаров из поставки или заявки на поставку",
              placement_zone: "Сладская зона",
              icon_path: "Ссылка на изображение",
            },
          },
          clusterList: {
            sheet: "Кластеры FBO",
            sheetColor: "BLACK",
            rangeDate: ["A:A"],
            rangeNumber: ["B:B", "E:E"],
            header: {
              updated_at: "Обновлено",
              cluster_id: "ID кластера",
              cluster_name: "Название кластера",
              cluster_type: "Тип кластера",
              warehouse_id: "ID склада",
              warehouse_name: "Название склада",
              warehouse_type: "Тип склада",
              macrolocal_cluster_id: "ID кластера",
            },
          },
          warehousesAvailable: {
            sheet: "Загруженность складов FBO",
            sheetColor: "BLACK",
            pasteNumberRange: ["A:A"],
            pasteDateRanges: ["C:E"],
            header: {
              id: "ID склада",
              name: "Название склада",
              date: "Доступная дата для записи на поставку по местному времени",
              start: "Начало периода по местному времени",
              end: "Конец периода по местному времени",
              value:
                "Ср. кол-во товаров, которые склад может принять в день за период",
            },
          },
        },
        returns: {
          fobFbsList: {
            sheet: "Возвраты FBO и FBS",
            sheetColor: "#41ff00",
            rangeDate: ["S:V"],
            rangeText: ["A:A"],
            header: {
              id: "ID возврата",
              // company_id: "ID продавца",

              type: "Тип возврата",
              return_reason_name: "Причина возврата или отмены",
              schema: "Схема",

              // order_id: "ID заказа",
              order_number: "Номер заказа",
              posting_number: "Номер отправления",

              // place_id: "ID склада, где товар",
              place_name: "Название склада, где товар",
              // place_address: "Адрес склада, где товар",

              // target_place_id: "ID склада, куда едет возврат",
              target_place_name: "Название склада, куда едет возврат",
              // target_place_address: "Адрес склада, куда едет возврат",

              // sum_currency_code: "Стоимость хранения, валюта",
              sum_price: "Стоимость хранения",

              // tariffication_first_date: "Первый день тарификации за хранение",
              // tariffication_start_date: "Дата старта тарификации за хранение",
              // arrived_moment: "Дата, когда возврат был готов к выдаче",

              days: "Сколько дней возврат ожидает выдачи продавцу",
              // utilization_sum_currency_code: "Стоимость утилизации, валюта",
              utilization_sum_price: "Стоимость утилизации",
              // utilization_forecast_date: "Планируемая дата утилизации",

              sku: "Ozon SKU id",
              offer_id: "Артикул",
              product_name: "Название",
              // product_price_currency_code: "Стоимость товара, валюта",
              product_price_price: "Стоимость товара",
              // product_price_without_commission_currency_code:
              //   "Стоимость товара без комиссии, валюта",
              product_price_without_commission: "Стоимость товара без комиссии",
              commission_percent: "Процент комиссии",
              // product_commission_currency_code: "Размер комиссии, валюта",
              product_commission_price: "Размер комиссии",

              technical_return_moment:
                "Дата, когда заказ поставили на технический возврат",
              final_moment:
                "Дата, когда возврат прибыл на фулфилмент или выдан продавцу",
              cancelled_with_compensation_moment:
                "Дата, когда продавцу компенсировали возврат",
              return_date: "Дата, когда покупатель вернул товар",
              // logistic_barcode: "Штрихкод этикетки возврата",

              // visual_status_id: "ID статуса возврата",
              visual_status_display_name: "Название статуса возврата",
              // visual_status_sys_name: "Системное название статуса возврат",
              // change_moment: "Дата изменения статуса возврата",

              is_opened: "Вскрыт",
              is_super_econom: "Относится к товарам «Суперэконом»",

              // exemplars: "ID экземпляров",

              clearing_id: "Штрихкод изначального отправления",
              return_clearing_id:
                "Возвратный штрихкод изначального отправления",
              source_id: "ID возврата предыдущий",
              compensation_status_name: "Статус компенсации",
            },
          },
          rfbs: {
            sheet: "Возвраты rFBS",
            range: "A1:O",
            sheetColor: "#ff6700",
            datesRange: ["B:B"],
            states: {
              All: "Все заявки",
              New: "Новые",
              Delivering: "В пути",
              Checkout: "На проверке",
              Arbitration: "Спорные",
              Approved: "Согласованные",
              Rejected: "Отклонённые",
            },
            header: {
              client_name: "Имя покупателя",
              created_at: "Дата создания заявки",
              order_number: "Номер заказа",
              posting_number: "Номер отправления",
              name: "Название",
              offer_id: "Артикул",
              currency_code: "Валюта",
              price: "Цена",
              sku: "Ozon SKU id",
              return_id: "ID заявки на возврат",
              return_number: "Номер заявки на возврат",
              group_state: "Статус заявки по применённому фильтру",
              money_return_state_name: "Статус возврата денег",
              state: "Статус заявки",
              state_name: "Название статуса заявки на русском",
            },
          },
        },
        prices: {
          short: {
            sheet: "Цены",
            range: "A1:O",
            sheetColor: "BLUE",
            rangesDates: ["A:A", "N:O"],
            rangesText: ["D:E"],
            header: {
              updated_at: "Обновлено",
              product_id: "Ozon id",
              sku: "Ozon SKU id",
              offer_id: "Артикул",
              barcode: "Штрих-код",
              product_name: "Название",
              currency_code: "Валюта ваших цен (настройки ЛК)",
              price: "Цена с учётом скидок (на карточке товара)",
              old_price: "Цена до учёта скидок (зачёркнутая)",
              marketing_seller_price: "Цена с учетом акций продавца",
              min_price: "Min цена после применения всех скидок",
              auto_action_enabled: "Автоприменение акций",
              auto_add_to_ozon_actions_list_enabled:
                "Автодобавление товара в акции Ozon",
              marketing_date_from: "Дата начала акции",
              marketing_date_to: "Дата окончания акции",
              marketing_title: "Название акции продавца",
              marketing_discount_value: "Скидка по акции продавца",
            },
          },
          full: {
            sheet: "Цены (всё)",
            range: "A1:O",
            sheetColor: "BLUE",
            rangesDates: ["A:A", "AQ:AR", "AU:AV"],
            rangesText: ["D:E"],

            header: {
              updated_at: "Обновлено",

              product_id: "Ozon id",
              sku: "Ozon SKU id",
              offer_id: "Артикул",
              barcode: "Штрих-код",
              product_name: "Название",

              // price Цена товара
              price_currency_code: "Валюта ваших цен (настройки ЛК)",
              price_old_price: "Цена до учёта скидок (зачёркнутая)",
              price_price: "Цена с учётом скидок (на карточке товара)",
              price_marketing_seller_price: "Цена с учетом акций продавца",
              price_min_price: "Min цена после применения всех скидок",
              price_retail_price: "Цена поставщика по договору",
              net_price: "Себестоимость товара",
              price_vat: "Ставка НДС для товара",
              price_auto_action_enabled: "Автоприменение акций включено",
              price_auto_add_to_ozon_actions_list_enabled:
                "Автодобавление товара в акции Ozon",

              // commissions Информация о комиссиях
              commissions_fbo_deliv_to_customer_amount: "Последняя миля (FBO)",
              commissions_fbo_direct_flow_trans_min_amount:
                "Магистраль от (FBO)",
              commissions_fbo_direct_flow_trans_max_amount:
                "Магистраль до (FBO)",
              commissions_fbo_return_flow_amount:
                "Комиссия за возврат и отмену (FBO)",

              commissions_fbs_deliv_to_customer_amount: "Последняя миля (FBS)",
              commissions_fbs_direct_flow_trans_min_amount:
                "Магистраль от (FBS)",
              commissions_fbs_direct_flow_trans_max_amount:
                "Магистраль до (FBS)",
              commissions_fbs_first_mile_min_amount:
                "Min комиссия за обработку отправления (FBS)",
              commissions_fbs_first_mile_max_amount:
                "Max комиссия за обработку отправления (FBS)",
              commissions_fbs_return_flow_amount:
                "Комиссия за возврат и отмену, обработка отправления (FBS)",

              commissions_sales_percent_fbo: "% комиссии за продажу (FBO)",
              commissions_sales_percent_fbs: "% комиссии за продажу (FBS)",
              commissions_sales_percent_rfbs: "% комиссии за продажу (rFBS)",
              commissions_sales_percent_fbp: "% комиссии за продажу (FBP)",

              // price_indexes Ценовые индексы товара
              // external_index_data Цена товара у конкурентов на других площадках
              external_index_minimal_price:
                "Min цена товара у конкурентов на другой площадке",
              external_index_minimal_price_currency:
                "Валюта цены у конкурентов на других площадках",
              external_index_price_index_value:
                "Значение индекса цены у конкурентов на других площадках",
              // ozon_index_data Цена товара у конкурентов на Ozon
              ozon_index_minimal_price: "Min цена товара у конкурентов на Ozon",
              ozon_index_minimal_price_currency:
                "Валюта цены у конкурентов на Ozon",
              ozon_index_price_index_value:
                "Значение индекса цены у конкурентов на Ozon",
              // self_marketplaces_index_data Цена вашего товара на других площадках
              self_marketplaces_index_minimal_price:
                "Min цена вашего товара на других площадках",
              self_marketplaces_index_minimal_price_currency:
                "Валюта цены вашего товара на других площадках",
              self_marketplaces_index_price_index_value:
                "Значение индекса цены вашего товара на других площадках",

              price_indexes_price_index: "Итоговый индекс цены товара",

              acquiring: "Max комиссия за эквайринг",
              volume_weight: "Объёмный вес товара",

              // marketing_actions
              // actions Маркетинговые акции продавца для каждой акции продавца.
              marketing_actions_actions_date_from:
                "Дата и время начала акции продавца",
              marketing_actions_actions_date_to:
                "Дата и время окончания акции продавца",
              marketing_actions_actions_title: "Название акции продавца",
              marketing_actions_actions_discount_value:
                "Скидка по акции продавца",
              marketing_actions_current_period_from:
                "Дата и время начала текущего периода по всем действующим акциям",
              marketing_actions_current_period_to:
                "Дата и время окончания текущего периода по всем действующим акциям",
              marketing_actions_ozon_actions_exist:
                "Может быть применена акция за счёт Ozon",
            },
          },
          update: {
            sheet: "🔄 Обновить цены",
            sheetLog: "📝 LOG загрузки цен",

            rangeDataValidations: ["J:N"],
            rangeDate: ["A:A"],

            sheetColor: "BLUE",

            header: {
              updated_at: "Обновлено",
              product_id: "Ozon id",
              sku: "Ozon SKU id", // ?
              offer_id: "Артикул",
              barcode: "Штрих-код", // ?
              product_name: "Название", // ?
              price: "Цена товара",
              old_price: "Цена до учёта скидок",
              min_price: "Мин. цена после всех скидок",
              currency_code: "Валюта цен",
              auto_action: "Автоприменение акций",
              auto_add_to_ozon_actions_list_enabled:
                "Автодобавление товара в акции Ozon",
              price_strategy_enabled: "Автоприменения стратегий цены",
              vat: "Ставка НДС", // ?
            },

            headerAdd: [
              "Размер кванта (offer_id = quant_id)",
              "Новая цена",
              "Цена до скидок (зачеркнутая)",
              "Новая мин. цена (автопр. ENABLED)",
            ],

            formulas: [
              "Размер кванта (offer_id = quant_id)",
              `={"Новая цена";ArrayFormula(IFNA(IF(INDIRECT("G2:G")<>ROUND(VLOOKUP(INDIRECT("D2:D");'Новые цены'!A:C;2;0);0);ROUND(VLOOKUP(INDIRECT("D2:D");'Новые цены'!A:C;2;0);0););))}`,
              `={"Цена до скидок (зачеркнутая)";ArrayFormula(IFNA(IF(INDIRECT("H2:H")<>ROUND(VLOOKUP(INDIRECT("D2:D");'Новые цены'!A:C;3;0);0);ROUND(VLOOKUP(INDIRECT("D2:D");'Новые цены'!A:C;3;0);0););))}`,
              // `={"Новая мин. цена (автопр. ENABLED)";ArrayFormula(IFNA(IF(((INDIRECT("K2:K")="ENABLED")*(INDIRECT("I2:I")<>VLOOKUP(INDIRECT("D2:D");'Новые цены'!A:D;4;0)));VLOOKUP(INDIRECT("D2:D");'Новые цены'!A:D;4;0););))}`,
              `={"Новая мин. цена (автопр. ENABLED)";ArrayFormula(IFNA(IF(INDIRECT("I2:I")<>ROUND(VLOOKUP(INDIRECT("D2:D");'Новые цены'!A:D;4;0);0);ROUND(VLOOKUP(INDIRECT("D2:D");'Новые цены'!A:D;4;0);0););))}`,
            ],

            sheetDataValidation: "DV",

            currencyCodeRange: ["J2:J"],
            currencyCode: [
              ["RUB"],
              ["BYN"],
              ["KZT"],
              ["EUR"],
              ["USD"],
              ["CNY"],
            ],
            currencyComment: `Валюта ваших цен. Переданное значение должно совпадать с валютой, которая установлена в настройках личного кабинета.
            По умолчанию RUB — российский рубль.
            Если у вас установлена валюта взаиморасчётов юань, передавайте CNY, иначе вернётся ошибка.

            Возможные значения:
            RUB — российский рубль,
            BYN — белорусский рубль,
            KZT — тенге,
            EUR — евро,
            USD — доллар США,
            CNY — юань.`,

            autoActionRange: ["K2:K"],
            autoActionColumn: 11,
            autoAction: [
              ["UNKNOWN"],
              ["ENABLED"],
              ["DISABLED"],
              ["FALSE"],
              ["TRUE"],
            ],
            autoActionComment: `Атрибут для включения и выключения автоприменения акций:
            ENABLED — включить автоприменение акций;
            DISABLED — выключить автоприменение акций;
            UNKNOWN — ничего не менять, передаётся по умолчанию.
            Пример: если ранее вы включили автоприменение акций и не хотите выключать его, передавайте UNKNOWN.

            Значения:
            TRUE — включено (для отключения выберите DISABLED);
            FALSE — отключено.

            Если передаёте ENABLED, установите значение минимальной цены в параметре min_price.`,

            autoActionOzonRange: ["L2:L"],
            autoActionColumn: 12,
            autoActionOzon: [
              ["UNKNOWN"],
              ["ENABLED"],
              ["DISABLED"],
              ["FALSE"],
              ["TRUE"],
            ],
            autoActionOzonComment: `Атрибут для включения и выключения автодобавления товара в акции Ozon:
            ENABLED — включить;
            DISABLED — выключить;
            UNKNOWN — ничего не менять, передаётся по умолчанию.`,

            priceStrategyRange: ["M2:M"],
            priceStrategyColumn: 13,
            priceStrategy: [["UNKNOWN"], ["ENABLED"], ["DISABLED"]],
            priceStrategyComment: `Атрибут для автоприменения стратегий цены:

            ENABLED — включить;
            DISABLED — выключить;
            UNKNOWN — ничего не менять, передаётся по умолчанию.
            Если ранее вы включили автоприменение стратегий цены и не хотите выключать его, передавайте UNKNOWN в следующих запросах.

            Если вы передаёте ENABLED в этом параметре, установите значение минимальной цены в параметре min_price.

            Если вы передаёте DISABLED в этом параметре, товар удаляется из стратегии.`,

            vatRange: ["N2:N"],
            vat: [0, 0.05, 0.07, 0.1, 0.13, 0.2],
            vatComment: `Ставка НДС для товара:
            0 — не облагается НДС,
            0.05 — 5%,
            0.07 — 7%,
            0.1 — 10%,
            0.2 — 20%.

            Передавайте значение ставки, актуальное на данный момент.`,

            quantSizeRange: ["O2:O"],
            quantSize: Array.from({ length: 50 }, (_, index) => index + 1),
            quantSizeComment: `Используйте параметр, если у обычного и эконом-товара совпадает артикул — offer_id = quant_id. Чтобы обновить цену:

            обычного товара — передайте значение 1;
            эконом-товара — передайте размер его кванта.
            Если у обычного и эконом-товара разные артикулы, не передавайте параметр.`,
          },
        },
        stocks: {
          info: {
            sheet: "Остатки",
            sheetColor: "BLUE",
            rangeText: ["D:E"],
            header: [
              "Обновлено",
              "Ozon id",
              "Ozon SKU id",
              "Артикул",
              "Штрих-код",
              "Название",
              "Склад",
              "Сейчас на складе",
              "Доступно",
              "Резерв",
              "Тип упаковки",
            ],
          },
          by_warehouse: {
            sheet: "Остатки FBS и rFBS",
            sheetUpdate: "🔄 Обновить остатки (по складам)",
            sheetLog: "📝 LOG обновление остатков",

            sheetColor: "BLUE",
            rangeNumber: ["J:J"],
            rangeText: ["D:E"],
            rangeDate: ["A:A"],

            header: [
              "Обновлено",
              "Ozon id",
              "Ozon SKU id",
              "Артикул",
              "Штрих-код",
              "Название",
              "Сейчас на складе",
              "Доступно",
              "Резерв",
              "ID склада",
              "Склад",
            ],
            formulas: [
              `={"Новый остаток";ArrayFormula(LET(id;INDIRECT("J2:J")&INDIRECT("D2:D");range;{'Остатки на складе'!$A:$A&'Остатки на складе'!$B:$B\\'Остатки на складе'!$C:$C};IF(INDIRECT("D2:D")="";;IFNA(IF(INDIRECT("G2:G")<>VLOOKUP(id;range;2;0);VLOOKUP(id;range;2;0);)))))}`,
            ],
          },
        },
        wherehouses: {
          info: {
            sheet: "Cписок складов FBS",
            sheetColor: "BLACK",
            status: {
              new: "Активируется",
              created: "Активный",
              disabled: "В архиве",
              blocked: "Заблокирован",
              disabled_due_to_limit: "На паузе",
              error: "Ошибка",
            },
            header: [
              "Склад",
              "ID склада",
              "Статус склада",
              "Работает с эконом-товарами",
              "Принимает крупногабаритные товары",
              "Схема rFBS",
              // "Доставка comfort (от 60 минут)",
              // "Доставка express (до 60 минут)",
              // "Тип этикетки",
            ],
            rangeNumber: ["B:B"],
          },
        },
        /** Цены и остатки товаров*/
        all: {
          productPhoto: {
            sheet: "Фото товаров",
            sheetColor: "BLACK",
            rangeDates: ["A:A", "N:N"],
            header: [
              "Ozon id",
              "Главное фото",
              "Ссылка на товар",
              "Ozon SKU id",
              "ID кванта",
              "Артикул",
              "Штрих-код",
              "Название",
              "Установлена цена",
              "Есть остаток на складах",
              "Статус товара",
              "Описание статуса товара",
              "Описание статуса",
              "Обновлено",
              "НДС",
              "Объёмный вес товара",
              "Цена до учёта скидок (зачеркнутая)",
              "Цена с учётом скидок",
              "Min цена товара после применения акций",
              "Доступно FBO",
              "Резерв FBO",
              "Доступно FBS",
              "Резерв FBS",
              "Фото товара",
              // "Доступно Discounted",
              // "Резерв Discounted",
              // "Доступно Crossborder",
              // "Резерв Crossborder",
              // "Схема продажи",
            ],
          },
          productsList: {
            sheet: "Список товаров",
            sheetColor: "BLACK",
            // header: [
            //   "Ozon id",
            //   "Гланове фото",
            //   "Ссылка на товар",
            //   "Ozon SKU id",
            //   "Артикул",
            //   "Название",
            //   "Выставлен на продажу",
            // ],
          },
        },
        /** Работа с отзывами*/
        rewiews: {
          sheetColor: "#009EFA",
          list: {
            sheet: "Список отзывов",
            rangesDates: ["B:B"],
            rangeCheckboxes: "M2:P",
            rangeDataValidations: "M2:P",
            rangeWarning: "L1:P1",
            header: {
              id: "ID отзыва",
              published_at: "Дата публикации",
              status: "Статус отзыва",
              text: "Текст отзыва",
              rating: "Оценка",
              comments_amount: "Кол-во комментариев",
              photos_amount: "Кол-во изображений",
              videos_amount: "Кол-во видео",
              sku: "Ozon SKU id",
              order_status: "Статус заказа",
              is_rating_participant: "Участвует в подсчёте рейтинга",
            },
            headerWorkingWithReviews: {
              id: "ID отзыва",
              published_at: "Дата публикации",
              status: "Статус отзыва",
              text: "Текст отзыва",
              rating: "Оценка",
              comments_amount: "Кол-во комментариев",
              photos_amount: "Кол-во изображений",
              videos_amount: "Кол-во видео",
              sku: "Ozon SKU id",
              order_status: "Статус заказа",
              is_rating_participant: "Участвует в подсчёте рейтинга",
              textComment: "Текст комментария на отзыв",
              leaveComment: "Оставить комментарий",
              getCommentList: "Получить список комментариев",
              toProcessed: "В статус обработанный",
              toUnprocessed: "В статус необработанный",
            },
          },
          info: {
            sheet: "Информация об отзывах",
            header: {
              id: "ID отзыва",
              published_at: "Дата публикации",
              status: "Статус отзыва",
              text: "Текст отзыва",
              rating: "Оценка",
              comments_amount: "Кол-во комментариев",
              likes_amount: "Кол-во лайков на отзыве",
              dislikes_amount: "Кол-во дизлайков на отзыве",
              is_rating_participant: "Участвует в подсчёте рейтинга",
              sku: "Ozon SKU id",
              order_status: "Статус заказа",
              photos_amount: "Кол-во изображений",
              photos: "Фото",
              videos_amount: "Кол-во видео у отзыва",
              videos: "Видео",
            },
          },
          commentList: {
            sheet: "Список комментариев на отзывы",
            rangesDates: ["C:C"],
            rangeCheckboxes: "H2:I",
            rangeDataValidations: "H2:I",
            rangeWarning: "G1:I1",
            header: {
              id: "ID комментария",
              parent_comment_id:
                "ID родительского комментария, на который нужно ответить",
              published_at: "Дата публикации",
              text: "Текст комментария",
              is_official: "Комментарий оставило официальное лицо / покупатель",
              is_owner: "Оставил продавец / покупатель",
            },
            headerWorkingWithComments: {
              id: "ID комментария",
              parent_comment_id:
                "ID родительского комментария, на который нужно ответить",
              published_at: "Дата публикации",
              text: "Текст комментария",
              is_official: "Комментарий оставило официальное лицо / покупатель",
              is_owner: "Оставил продавец / покупатель",
              textComment: "Текст ответа на комментарий",
              leaveComment: "Оставить ответа на комментарий",
              deleteComment: "Удалить комментарий",
            },
          },
        },
        /** Акции */
        actions: {
          list: {
            sheet: "Список акций",
            sheetColor: "#009EFA",
            rangesDates: ["E:G"],
            header: {
              id: "ID акции",
              title: "Название акции",
              action_type: "Тип акции",
              description: "Описание акции",
              date_start: "Дата начала акции",
              date_end: "Дата окончания акции",
              freeze_date: "Дата приостановки акции",
              potential_products_count: "Кол-во товаров, доступных для акции",
              participating_products_count:
                "Кол-во товаров, участвующих в акции",
              is_participating: "Участвуете",
              is_voucher_action: "Покупателям нужен промокод",
              banned_products_count: "Кол-во заблокированных товаров",
              with_targeting: "Акция с целевой аудиторией",
              order_amount: "Сумма заказа",
              discount_type: "Тип скидки",
              discount_value: "Размер скидки",
            },
          },
          candidates: {
            sheet: "Доступные товары для акций",
            sheetColor: "#009EFA",
            rangeDataValidations: "R2:R",
            rangeCheckboxes: "R2:R",
            rangeWarning: "P1:R1",
            header: {
              action_id: "ID акции",
              id: "Ozon id",
              price: "Текущая цена товара без скидки",
              action_price: "Цена товара по акции",
              max_action_price: "Макс. возможная цена товара по акции",
              alert_max_action_price: "Рекомендуемая цена товара по акции",
              alert_max_action_price_failed: "Цена товара выше рекомендуемой",
              add_mode: "Тип добавления в акцию",
              stock: "Число ед. товара в акции типа «Скидка на сток»",
              min_stock: "Мин. число ед. товара в акции «Скидка на сток»",

              current_boost: "Размер бустинга товара",
              price_min_elastic: "Цена товара для min размера бустинга",
              price_max_elastic: "Цена товара для max размера бустинга",
              min_boost: "Min размер бустинга в %",
              max_boost: "Max размер бустинга в %",

              stockUpdate: "Кол-во ед. товара в акции",
              new_action_price: "Цена товара по акции",
              update: "Добавить в акцию",
              offer_id: "Артикул",
              product_name: "Название",
              actionName: "Название акции",
            },
          },
          products: {
            sheet: "Список товаров в акциях",
            sheetColor: "#009EFA",
            rangeDataValidations: "P2:P",
            rangeCheckboxes: "P2:P",
            rangeWarning: "P1",
            header: {
              action_id: "ID акции",
              id: "Ozon id",
              price: "Текущая цена товара без скидки",
              action_price: "Цена товара по акции",
              max_action_price: "Макс. возможная цена товара по акции",
              alert_max_action_price: "Рекомендуемая цена товара по акции",
              alert_max_action_price_failed: "Цена товара выше рекомендуемой",
              add_mode: "Тип добавления в акцию",
              stock: "Число ед. товара в акции типа",
              min_stock: "Мин. число ед. товара в акции",

              current_boost: "Размер бустинга товара",
              price_min_elastic: "Цена товара для min размера бустинга",
              price_max_elastic: "Цена товара для max размера бустинга",
              min_boost: "Min размер бустинга в %",
              max_boost: "Max размер бустинга в %",

              update: "Удалить",
              offer_id: "Артикул",
              product_name: "Название",
              actionName: "Название акции",
            },
          },
          discountsTask: {
            list: {
              sheet: "Список заявок на скидку",
              sheetColor: "#009EFA",
              rangesDates: ["J:L", "Y:Y"],
              rangeDataValidations: "A2:A",
              rangeCheckboxes: "A2:A",
              rangeNumber: ["B:B"],
              rangeWarning: ["A1", "C1:F1"],
              header: {
                approve_decline: "Согласовать / Отклонить",
                id: "ID заявки",
                seller_comment: "Комментарий продавца к заявке",

                approved_price: "Одобренная цена",
                approved_quantity_min: "Min одобренное кол-во товаров",
                approved_quantity_max: "Max одобренное кол-во товаров",

                requested_price: "Цена по заявке",
                requested_quantity_min: "Запрошенное Min кол-во товаров",
                requested_quantity_max: "Запрошенное Max кол-во товаров",

                created_a: "Дата создания заявки",
                end_at: "Время окончания действия заявки",
                edited_till: "Время для изменения решения",
                status: "Статус заявки",
                customer_name: "Имя покупателя",
                sku: "Ozon SKU id",
                offer_id: "Артикул",
                user_comment: "Комментарий покупателя к заявке",

                original_price: "Цена товара до всех скидок",
                discount: "Скидка в рублях",
                discount_percent: "Скидка в %",
                base_price: "Базовая цена, на Ozon, если не участвует в акции.",
                min_auto_price:
                  "Min значение цены после автоприменения скидок и акций",
                prev_task_id:
                  "ID предыдущей заявки от покупателя по этому товару",
                is_damaged: "Уцененный",
                moderated_at:
                  "Дата модерации (просмотра, одобрения или отклонения)",
                approved_discount: "Скидка в рублях, которую одобрил продавец",
                approved_discount_percent:
                  "Скидка в процентах, которую одобрил продавец",
                is_purchased: "Покупал пользователь товар",
                is_auto_moderated: "Заявка была промодерирована автоматически",
                email: "Email сотрудника продавца, который обработал заявку",
                last_name:
                  "Фамилия сотрудника продавца, который обработал заявку",
                first_name: "Имя сотрудника продавца, который обработал заявку",
                patronymic:
                  "Отчество сотрудника продавца, который обработал заявку",
                requested_price_with_fee:
                  "Цена по заявке c региональной наценкой",
                approved_price_with_fee:
                  "Одобренная цена с региональной наценкой",
                approved_price_fee_percent: "Региональная наценка в %",
              },
            },
          },
        },
        reports: {
          /** МЕТОДЫ ДЛЯ РАБОТЫ С ОТЧЕТАМИ */
          csv: {
            products: {
              sheet: "Отчёт по товарам",
              sheetColor: "#0000ff",
              formulaLink: `={"Ссылка";ArrayFormula(IF(INDIRECT("C2:C")="";;"https://www.ozon.ru/product/"&INDIRECT("C2:C")))}`,
              rangesDates: ["O:O", "M:M"],
              headerKeysToFind: [
                "Контент-рейтинг",
                "Отзывы",
                "Рейтинг",
                "Объем товара, л",
                "Объемный вес, кг",
                "Доступно к продаже по схеме FBO, шт.",
                "Вывезти и нанести КИЗ (кроме Твери), шт",
                "Зарезервировано, шт",
                "Доступно к продаже по схеме FBS, шт.",
                "Доступно к продаже по схеме realFBS, шт.",
                "Зарезервировано на моих складах, шт",
                "Текущая цена с учетом скидки, ₽",
                "Цена до скидки (перечеркнутая цена), ₽",
                "Цена Premium, ₽",
                "Рыночная цена, ₽",
              ],
              headerQuant: ["Количество товара в кванте"],
              headerDateCreated: ["Дата создания"],
            },
            returns: {
              sheet: "Отчёт о возвратах FBO и FBS",
              range: "A1:ZZZ",
              sheetColor: "#0000ff",
              rangeDate: ["F:F", "O:Q", "AA:AA"],
              rangeNumberShort: ["A:B"],
              status: {
                "на согласовании у продавца": "OnSellerApproval",
                "в пункте выдачи": "ArrivedAtReturnPlace",
                "на уточнении у продавца": "OnSellerClarification",
                "на уточнении у продавца после частичной компенсации":
                  "OnSellerClarificationAfterPartialCompensation",
                "предложена частичная компенсация":
                  "OfferedPartialCompensation",
                "одобрен возврат денег": "ReturnMoneyApproved",
                "вернули часть денег": "PartialCompensationReturned",
                "возврат отклонён, спор не открыт": "CancelledDisputeNotOpen",
                "заявка отклонена": "Rejected",
                "заявка отклонена Ozon": "CrmRejected",
                "заявка отменена": "Cancelled",
                "заявка одобрена продавцом": "Approved",
                "заявка одобрена Ozon": "ApprovedByOzon",
                "продавец получил возврат": "ReceivedBySeller",
                "возврат на пути к продавцу": "MovingToSeller",
                "продавец получил компенсацию": "ReturnCompensated",
                "курьер везёт возврат продавцу": "ReturningToSellerByCourier",
                "на утилизации": "Utilizing",
                утилизирован: "Utilized",
                "покупателю вернули всю сумму": "MoneyReturned",
                "одобрен частичный возврат денег":
                  "PartialCompensationInProcess",
                "продавец открыл спор": "DisputeYouOpened",
                "отказано в компенсации": "CompensationRejected",
                "обращение в поддержку отправлено": "DisputeOpening",
                "ожидает вашего решения по компенсации": "CompensationOffered",
                "ожидает компенсации": "WaitingCompensation",
                "ошибка при отправке обращения в поддержку": "SendingError",
                "истёк срок решения": "CompensationRejectedBySla",
                "продавец отказался от компенсации":
                  "CompensationRejectedBySeller",
                "едет на склад Ozon": "MovingToOzon",
                "на складе Ozon": "ReturnedToOzon",
                "быстрый возврат": "MoneyReturnedBySystem",
                "ожидает отправки": "WaitingShipment",
              },
            },
            postings: {
              sheetFbs: "Отчёт об отправлениях FBS",
              sheetFbo: "Отчёт об отправлениях FBO",
              range: "A1:ZZZ",
              sheetColor: "#0000ff",
              datesRanges: ["C:D", "F:F"],
              dateTimeRanges: ["G:G"],
            },
            cashFlowStatement: {
              sheet: "Финансовый отчёт",
              sheetWithDetails: "Финансовый отчёт (расшифровка)",
              range: "A1:S",
              sheetColor: "#0000ff",
              rangesDates: ["A:B"],
              header: {
                periodBegin: "Начало периода",
                periodend: "Конец периода",
                orders_amount: "Сумма цен реализованных товаров",
                returns_amount: "Сумма цен возвращённых товаров",
                commission_amount: "Комиссия Ozon за реализацию товаров",
                services_amount: "Сумма дополнительных услуг",
                item_delivery_and_return_amount: "Сумма услуг логистики",
                currency_code: "Код валюты",
              },

              items: {
                delivery_services: {
                  MarketplaceServiceItemDirectFlowLogisticSum: "Логистика",
                  MarketplaceServiceItemDirectFlowLogisticDC: "Логистика РЦ",
                  MarketplaceServiceItemDropoff:
                    "Обработка отправления Drop-off",
                  MarketplaceServiceItemDirectFlowTrans: "Магистраль",
                  MarketplaceServiceDCFlowTrans: "Магистраль РЦ",
                  MarketplaceServiceItemFulfillment: "Сборка заказа",
                  MarketplaceServiceItemDelivToCustomer: "Последняя миля",
                },
                return_services: {
                  MarketplaceServiceItemReturnAfterDelivToCustomer:
                    "Обработка возвратов",
                  MarketplaceServiceItemReturnPartGoodsCustomer:
                    "Обработка частичного невыкупа",
                  MarketplaceServiceItemReturnNotDelivToCustomer:
                    "Обработка отменённых и невостребованных товаров",
                  MarketplaceServiceItemReturnFlowLogistic:
                    "Обратная логистика",
                  MarketplaceServiceItemRedistributionReturnsPVZ:
                    "Перевыставление возвратов на ПВЗ",
                },
                services: {
                  MarketplaceServiceItemElectronicServiceStencil:
                    "Услуга «Трафареты»",
                  MarketplaceServiceItemElectronicServicesPromotionInSearch:
                    "Услуга «Продвижение в поиске»",
                  MarketplaceServiceItemElectronicServicesBrandShelf:
                    "Услуга «Брендовая полка»",
                  MarketplaceServiceBrandPromotion:
                    "Услуга «Продвижение бренда»",
                  MarketplaceServiceBrandCommission:
                    "Услуга «Продвижение бренда»",
                  MarketplaceServiceItemMarketingServices:
                    "Маркетинговые услуги",
                  MarketplaceServiceItemTechnicalServicesAndOtherServices:
                    "Технические и иные услуги",
                  MarketplaceServiceItemOtherElectronicServices:
                    "Иные электронные услуги",
                  ItemAgentServiceStarsMembership: "Звёздные товары",
                  MarketplaceReturnStorageServiceAtThePickupPointFbsItem:
                    "Краткосрочное размещение возврата FBS",
                  MarketplaceSaleReviewsItem:
                    "Приобретение отзывов на платформе",
                  MarketplaceServicePremiumCashbackIndividualPoints:
                    "Услуга продвижения «Бонусы продавца»",
                  OperationMarketplaceServiceStorage:
                    "Услуга размещения товаров",
                  MarketplaceServiceStockDisposal: "Утилизация со стока",
                  MarketplaceReturnDisposalServiceFbsItem: "Утилизация FBS",
                  MarketplaceServiceItemFlexiblePaymentSchedule:
                    "Услуга «Гибкий график выплат»",
                  MarketplaceServiceProcessingSpoilage: "Обработка брака",
                  MarketplaceServiceProcessingIdentifiedSurplus:
                    "Обработка опознанных излишков",
                  MarketplaceServiceProcessingIdentifiedDiscrepancies:
                    "Бронирование места для размещения на складе",
                  MarketplaceServiceItemInternetSiteAdvertising:
                    "Реклама на сайте Ozon",
                  MarketplaceServiceItemSubscribtionPremium: "Премиум-подписка",
                  MarketplaceAgencyFeeAggregator3PLGlobalItem:
                    "Агентское вознаграждение Ozon",
                },
                others: {
                  MarketplaceRedistributionOfAcquiringOperation:
                    "Оплата эквайринга",
                  MarketplaceSellerCompensationLossOfGoodsOperation:
                    "Компенсация за уничтоженный товар",
                  MarketplaceSellerCorrectionOperation:
                    "Корректировка стоимости услуг",
                  OperationCorrectionSeller: "Инвентаризация взаиморасчётов",
                  OperationMarketplaceWithHoldingForUndeliverableGoods:
                    "Уомпенсация за недовложение товаров",
                  OperationClaim: "Начисления по претензиям",
                },
              },

              headerDetails: {
                period_begin: "Начало периода",
                period_end: "Конец периода",
                begin_balance_amount: "Баланс на начало периода",
                end_balance_amount: "Баланс на конец периода",
                orders_amount: "Сумма цен реализованных товаров",
                payments_sum: "Выплачено за период",

                delivery_total: "Заказы. Общая сумма",
                delivery_amount:
                  "Заказы. Суммав, на которую выкуплено товаров с учётом комиссий",
                delivery_selivery_services_total:
                  "Заказы.Плата за обработку и доставку",
                // MarketplaceServiceItemDirectFlowLogisticSum: "Логистика",
                // MarketplaceServiceItemDirectFlowLogisticDC: "Логистика РЦ",
                // MarketplaceServiceItemDropoff: "Обработка отправления Drop-off",
                // MarketplaceServiceItemDirectFlowTrans: "Магистраль",
                // MarketplaceServiceDCFlowTrans: "Магистраль РЦ",
                // MarketplaceServiceItemFulfillment: "Сборка заказа",
                // MarketplaceServiceItemDelivToCustomer: "Последняя миля",

                return_total: "Возвраты и отмены. Общая сумма",
                return_amount:
                  "Возвраты и отмены. Сумма, на которую получено возвратов с учётом комиссий",
                return_return_services_total:
                  "Возвраты и отмены. Плата за возвраты и отмены",
                // MarketplaceServiceItemReturnAfterDelivToCustomer:
                //   "Обработка возвратов",
                // MarketplaceServiceItemReturnPartGoodsCustomer:
                //   "Обработка частичного невыкупа",
                // MarketplaceServiceItemReturnNotDelivToCustomer:
                //   "Обработка отменённых и невостребованных товаров",
                // MarketplaceServiceItemReturnFlowLogistic: "Обратная логистика",
                // MarketplaceServiceItemRedistributionReturnsPVZ:
                // "Перевыставление возвратов на ПВЗ",

                loan: "Перевод по договорам займа",
                invoice_transfer: "Сумма к выплате за период",
                services_total: "Услуги",
                // MarketplaceServiceItemElectronicServiceStencil:
                //   "Услуга «Трафареты»",
                // MarketplaceServiceItemElectronicServicesPromotionInSearch:
                //   "Услуга «Продвижение в поиске»",
                // MarketplaceServiceItemElectronicServicesBrandShelf:
                //   "Услуга «Брендовая полка»",
                // MarketplaceServiceBrandPromotion: "Услуга «Продвижение бренда»",
                // MarketplaceServiceBrandCommission:
                //   "Услуга «Продвижение бренда»",
                // MarketplaceServiceItemMarketingServices: "Маркетинговые услуги",
                // MarketplaceServiceItemTechnicalServicesAndOtherServices:
                //   "Технические и иные услуги",
                // MarketplaceServiceItemOtherElectronicServices:
                //   "Иные электронные услуги",
                // ItemAgentServiceStarsMembership: "Звёздные товары",
                // MarketplaceReturnStorageServiceAtThePickupPointFbsItem:
                //   "Краткосрочное размещение возврата FBS",
                // MarketplaceSaleReviewsItem: "Приобретение отзывов на платформе",
                // MarketplaceServicePremiumCashbackIndividualPoints:
                //   "Услуга продвижения «Бонусы продавца»",
                // OperationMarketplaceServiceStorage: "Услуга размещения товаров",
                // MarketplaceServiceStockDisposal: "Утилизация со стока",
                // MarketplaceReturnDisposalServiceFbsItem: "Утилизация FBS",
                // MarketplaceServiceItemFlexiblePaymentSchedule:
                //   "Услуга «Гибкий график выплат»",
                // MarketplaceServiceProcessingSpoilage: "Обработка брака",
                // MarketplaceServiceProcessingIdentifiedSurplus:
                //   "Обработка опознанных излишков",
                // MarketplaceServiceProcessingIdentifiedDiscrepancies:
                //   "Бронирование места для размещения на складе",
                // MarketplaceServiceItemInternetSiteAdvertising:
                //   "Реклама на сайте Ozon",
                // MarketplaceServiceItemSubscribtionPremium: "Премиум-подписка",
                // MarketplaceAgencyFeeAggregator3PLGlobalItem:
                //   "Агентское вознаграждение Ozon",

                others_total: "Компенсация и прочие начисления",
                // MarketplaceRedistributionOfAcquiringOperation:
                //   "Оплата эквайринга",
                // MarketplaceSellerCompensationLossOfGoodsOperation:
                //   "Компенсация за уничтоженный товар",
                // MarketplaceSellerCorrectionOperation:
                //   "Корректировка стоимости услуг",
                // OperationCorrectionSeller: "Инвентаризация взаиморасчётов",
                // OperationMarketplaceWithHoldingForUndeliverableGoods:
                //   "Уомпенсация за недовложение товаров",
                // OperationClaim: "Начисления по претензиям",

                rfbs_total: "Схема rFBS. Общая сумма",
                rfbs_transfer_delivery:
                  "Схема rFBS. Перечисления от покупателей",
                rfbs_transfer_delivery_return:
                  "Схема rFBS. Возврат перечислений покупателям",
                rfbs_compensation_delivery_return:
                  "Схема rFBS. Компенсация перечислений за доставку",
                rfbs_partial_compensation:
                  "Схема rFBS. Перечисления частичных компенсаций покупателям",
                rfbs_partial_compensation_return:
                  "Схема rFBS. Возврат частичных компенсаций",
              },
            },
            discounted: {
              sheet: "Отчёт об уценённых товарах",
              range: "A1:ZZZ",
              sheetColor: "#0000ff",
              header: [
                "Артикул",
                "FBO OZON SKU ID",
                "FBO OZON SKU ID (уцененный товар)",
                "Название",
                "Бренд",
                "Состояние товара",
                "Причина уценки",
                "Дополнительная информация по уцененному товару",
                "Статус товара",
                "Видимость на сайте",
                "Доступно на складе Ozon, шт.",
                "Текущая цена с учетом скидок, руб.",
                "Текущая цена с учетом скидок, руб.",
              ],
            },
            stock: {
              sheet: "Отчёт об остатках на складах FBS",
              range: "A1:ZZZ",
              sheetColor: "#0000ff",
              rangeNumberShort: ["A:A"],
              header: [
                "Идентификатор склада",
                "Название склада",
                "Артикул",
                "Название",
                "Доступно на моем складе, шт.",
                "Зарезервировано на моем складе, шт.",
              ],
            },
          },
          /** МЕТОДЫ ДЛЯ РАБОТЫ С АНАЛИТИЧЕСКИМИ ОТЧЕАМИ */
          analytics: {
            data: {
              sheet: "Данные аналитики",
              range: "A:R",
              sheetColor: "RED",
              key: "day",
              dimension: ["category1", "sku", "day"],
              stop: ["day", "week", "month", "year"],
              dimensionDict: {
                unknownDimension: "Неизвестное измерение",
                sku: "Ozon SKU id",
                spu: "ID товара",
                day: "День",
                week: "Неделя",
                month: "Месяц",
                year: "Год",
                category1: "Категория первого уровня",
                category2: "Категория второго уровня",
                category3: "Категория третьего уровня",
                category4: "Категория четвертого уровня",
                brand: "Бренд",
                modelID: "Модель",
              },
              dimensionHeader: ["Категория", "Ozon SKU id", "Название", "Дата"],
              metrics: [
                "position_category",
                "hits_view_search",
                "hits_view_pdp",
                "hits_view",
                "hits_tocart_search",
                "hits_tocart_pdp",
                "hits_tocart",
                "session_view_search",
                "session_view_pdp",
                "session_view",
                "revenue",
                "ordered_units",
                "returns",
                "cancellations",
              ],
              metricsDict: {
                unknown_metric: "Неизвестная метрика",
                hits_view_search: "Показы в поиске и в категории",
                hits_view_pdp: "Показы на карточке товара",
                hits_view: "Всего показов",
                hits_tocart_search: "В корзину из поиска или категории",
                hits_tocart_pdp: "В корзину из карточки товара",
                hits_tocart: "Всего добавлено в корзину",
                session_view_search:
                  "Сессии с показом в поиске или в категории",
                session_view_pdp: "Сессии с показом на карточке товара",
                session_view: "Всего сессий",
                conv_tocart_search:
                  "Конверсия в корзину из поиска или категории",
                conv_tocart_pdp: "Конверсия в корзину из карточки товара",
                conv_tocart: "Общая конверсия в корзину",
                revenue: "Заказано на сумму",
                returns: "Возвращено товаров",
                cancellations: "Отменено товаров",
                ordered_units: "Заказано товаров",
                delivered_units: "Доставлено товаров",
                position_category: "Позиция в поиске и категории",
              },
              header: [
                "Категория",
                "Ozon SKU id",
                "Название",
                "Дата",
                "Позиция в поиске и категории",
                "Показы в поиске и в категории",
                "Показы на карточке товара",
                "Всего показов",
                "В корзину из поиска или категории",
                "В корзину из карточки товара",
                "Всего добавлено в корзину",
                "Сессии с показом в поиске или в категории",
                "Сессии с показом на карточке товара",
                "Всего сессий",
                "Заказано на сумму",
                "Заказано товаров",
                "Возвращено товаров",
                "Отменено товаров",
              ],

              rangeDate1: ["D:D"],
              rangeDate2: ["E:E"],
              rangeDate3: ["C:C"],

              rangeNumber1: ["E:H"],
              rangeNumber2: ["F:S"],
              rangeNumber3: ["D:E"],

              formulaArticle: `={"Артикул";ArrayFormula(IF(INDIRECT("C2:C")="";;IFNA(IFNA(IFNA(VLOOKUP(INDIRECT("C2:C");
              {'Отчёт по товарам'!\$C:\$C\\'Отчёт по товарам'!\$A:\$A};2;0);VLOOKUP(INDIRECT("C2:C");
              {'Отчёт по товарам'!\$D:\$D\\'Отчёт по товарам'!\$A:\$A};2;0)));"-")))}`,
            },
            stocks: {
              sheet: "Отчёт аналитика по остаткам FBO",
              range: "A:H",
              rangeDate: ["A:A"],
              rangeNumberShort: ["E:E"],
              sheetColor: "RED",
              header: {
                updated_at: "Обновлено",
                sku: "Ozon SKU id",
                offer_id: "Артикул",
                name: "Название",
                warehouse_id: "ID склада",
                warehouse_name: "Склад",
                cluster_id: "ID кластера",
                cluster_name: "Кластер",
                item_tags: "Теги товара",
                turnover_grade: "Статус ликвидности товара (по всем кластерам)",
                turnover_grade_cluster:
                  "Статус ликвидности товара (в кластере)",
                days_without_sales: "Дней без продаж (по всем кластерам)",
                days_without_sales_cluster: "Дней без продаж (в кластере)",

                ads: "Среднесут. кол-во проданных ед. товара за 28 дн. (по всем кластерам)",
                ads_cluster:
                  "Среднесут. кол-во проданных ед. товара за 28 дн. (в кластере)",
                idc: "Хватит остатка с учётом среднесут. продаж за 28 дн. (по всем кластерам)",
                idc_cluster:
                  "Хватит остатка с учётом среднесут. продаж за 28 дн. (в кластере)",

                available_stock_count: "Доступно к продаже",
                valid_stock_count: "Готовим к продаже",
                requested_stock_count: "В поставках",
                transit_stock_count: "В поставках в пути",
                other_stock_count: "На проверке",
                expiring_stock_count: "С истекающим сроком годности",
                return_from_customer_stock_count:
                  "В процессе возврата от покупателей",
                return_to_seller_stock_count:
                  "Готовящихся к вывозу по вашей заявке",
                waiting_docs_stock_count:
                  "Маркируемых товаров, ожидающих ваших действий",
                stock_defect_stock_count: "Брак, доступно к вывозу со стока",
                transit_defect_stock_count:
                  "Брак, доступно к вывозу с поставки",
                excess_stock_count: "Излишки с поставки, доступны к вывозу",
              },
            },
            stockOnWarehouses: {
              sheet: "Отчёт по остаткам и товарам FBO",
              range: "A:H",
              rangeDate: ["A:A"],
              sheetColor: "RED",
              header: {
                updated_at: "Обновлено",
                sku: "Ozon SKU id",
                item_code: "Артикул",
                item_name: "Название",
                free_to_sell_amount: "Доступно",
                promised_amount: "В поставках",
                reserved_amount: "Резерв",
                warehouse_name: "Склад",
              },
              formulaCluster: `={"Кластер";ArrayFormula(IF(INDIRECT("H2:H")="";;IFERROR(VLOOKUP(INDIRECT("H2:H");'Кластеры FBO'!$A:$B;2;0);"Нет соответствия")))}`,
            },
            turnoverStocks: {
              sheet: "Отчёт оборачиваемость товара FBO",
              rangeDate: ["A:A"],
              sheetColor: "RED",
              header: {
                updated_at: "Обновлено",
                sku: "Ozon SKU id",
                offer_id: "Aртикул",
                name: "Название",
                current_stock: "Остаток товара, шт.",
                ads: "Среднесуточное кол-во проданных ед. товара за последние 60 дн.",
                idc: "На сколько дн. хватит остатка товара с учётом среднесуточных продаж",
                turnover: "Фактическая оборачиваемость в дн.",
                idc_grade: "Уровень остатка товара",
                turnover_grade: "Уровень оборачиваемости",
              },
            },
            analyticsManageStocks: {
              sheet: "Управление остатками",
              rangeDate: ["A:A"],
              sheetColor: "RED",
              header: {
                updated_at: "Обновлено",
                sku: "Ozon SKU id",
                offer_id: "Aртикул",
                name: "Название",
                warehouse_name: "Название склада",
                valid_stock_count: "Доступно для продажи",
                waitingdocs_stock_count: "Ожидающие документы",
                defect_stock_count: "Дефектного товара",
                expiring_stock_count: "С истекающим сроком годности",
              },
            },
          },
          /** МЕТОДЫ ДЛЯ РАБОТЫ С ФИНАНСОВЫМИ ОТЧЕАМИ */
          finance: {
            realizations: {
              sheet: "Отчёт о реализации",
              range: "A1:ZZ",
              sheetColor: "#00c1ff",
              rangesDates: ["A:A"],
              header: {
                doc_date: "Дата формирования отчёта",
                number: "Номер отчёта о реализации",
                rowNumber: "Номер строки в отчёте",
                item_sku: "Ozon SKU id",
                item_offer_id: "Артикул",
                item_barcode: "Штрихкод товара",
                item_name: "Название",
                seller_price_per_instance: "Цена продавца с учётом скидки",
                commission_ratio: "Доля комиссии за продажу по категории",
                delivery_commission_amount: "Комиссия доставка. Сумма",
                delivery_commission_bonus: "Комиссия доставка. Баллы за скидки",
                delivery_commission_commission:
                  "Комиссия доставка (до 30.04.2024). Итого комиссия с учётом скидок и наценки",
                delivery_commission_compensation:
                  "Комиссия доставка (до 30.04.2024). Доплата за счёт Ozon",
                delivery_commission_price_per_instance:
                  "Комиссия доставка. Цена за экземпляр",
                delivery_commission_quantity:
                  "Комиссия доставка. Количество товара",
                delivery_commission_standard_fee:
                  "Комиссия доставка. Базовое вознаграждение Ozon",
                delivery_commission_stars:
                  "Комиссия доставка. Выплаты по механикам лояльности партнёров",

                delivery_commission_bank_coinvestment:
                  "Комиссия доставка. Выплаты по механикам лояльности партнёров: зелёные цены",
                delivery_commission_pick_up_point_coinvestment:
                  "Комиссия доставка. Выплаты по механикам лояльности партнёров: АПВЗ",

                delivery_commission_total:
                  "Комиссия доставка. Итого к начислению",
                return_commission_amount: "Комиссия возврат. Сумма",
                return_commission_bonus: "Комиссия возврат. Баллы за скидки",
                return_commission_commission:
                  "Комиссия возврат (до 30.04.2024). Итого комиссия с учётом скидок и наценки",
                return_commission_compensation:
                  "Комиссия возврат (до 30.04.2024). Доплата за счёт Ozon",
                return_commission_price_per_instance:
                  "Комиссия возврат. Цена за экземпляр",
                return_commission_quantity:
                  "Комиссия возврат. Количество товара",
                return_commission_standard_fee:
                  "Комиссия возврат. Базовое вознаграждение Ozon",
                return_commission_stars:
                  "Комиссия возврат. Выплаты по механикам лояльности партнёров",

                return_commission_bank_coinvestment:
                  "Комиссия возврат. Выплаты по механикам лояльности партнёров: зелёные цены",
                return_commission_pick_up_point_coinvestment:
                  "Комиссия возврат. Выплаты по механикам лояльности партнёров: АПВЗ",

                return_commission_total: "Комиссия возврат. Итого к начислению",
              },
            },
            realizationsPostings: {
              sheet: "Позаказный отчёт о реализации товаров",
              range: "A1:ZZ",
              sheetColor: "#00c1ff",
              rangesDates: ["A:A"],
              header: {
                doc_date: "Дата формирования отчёта",
                number: "Номер отчёта о реализации",

                order_posting_number: "Номер отправления",
                order_created_date: "Дата заказа",

                row_number: "Номер строки в отчёте",
                item_sku: "Ozon SKU id",
                item_offer_id: "Артикул",
                item_barcode: "Штрихкод товара",
                item_name: "Название",

                seller_price_per_instance: "Цена продавца с учётом скидки",
                commission_ratio: "Доля комиссии за продажу по категории",

                delivery_commission_amount: "Комиссия доставка. Сумма",
                delivery_commission_bonus: "Комиссия доставка. Баллы за скидки",
                delivery_commission_commission:
                  "Комиссия доставка. Итого комиссия с учётом скидок и наценки",
                delivery_commission_compensation:
                  "Комиссия доставка. Доплата за счёт Ozon",
                delivery_commission_price_per_instance:
                  "Комиссия доставка. Цена за экземпляр",
                delivery_commission_quantity:
                  "Комиссия доставка. Количество товара",
                delivery_commission_standard_fee:
                  "Комиссия доставка. Базовое вознаграждение Ozon",
                delivery_commission_bank_coinvestment:
                  "Комиссия доставка. Выплаты по механикам лояльности партнёров: зелёные цены",
                delivery_commission_stars:
                  "Комиссия доставка. Выплаты по механикам лояльности партнёров: звёзды",
                delivery_commission_pick_up_point_coinvestment:
                  "Комиссия доставка. Выплаты по механикам лояльности партнёров: АПВЗ",
                delivery_commission_total:
                  "Комиссия доставка. Итого к начислению",

                return_commission_amount: "Комиссия возврат. Сумма",
                return_commission_bonus: "Комиссия возврат. Баллы за скидки",
                return_commission_commission:
                  "Комиссия возврат. Итого комиссия с учётом скидок и наценки",
                return_commission_compensation:
                  "Комиссия возврат. Доплата за счёт Ozon",
                return_commission_price_per_instance:
                  "Комиссия возврат. Цена за экземпляр",
                return_commission_quantity:
                  "Комиссия возврат. Количество товара",
                return_commission_standard_fee:
                  "Комиссия возврат. Базовое вознаграждение Ozon",
                return_commission_bank_coinvestment:
                  "Комиссия возврат. Выплаты по механикам лояльности партнёров: зелёные цены",
                return_commission_stars:
                  "Комиссия возврат. Выплаты по механикам лояльности партнёров: звёзды",
                return_commission_pick_up_point_coinvestment:
                  "Комиссия возврат. Выплаты по механикам лояльности партнёров: АПВЗ",
                return_commission_total: "Комиссия возврат. Итого к начислению",

                legal_entity_document_number: "Номер счёта-фактуры",
                legal_entity_document_sale_date: "Дата счёта-фактуры",
              },
            },
            transactionList: {
              sheet: "Список транзакций",
              sheetGrupped: "Список транзакций",
              rangesDates: ["A:A", "E:E"],
              rangesNumber: ["B:B", "D:D"],
              range: "A1:ZZ",
              sheetColor: "#00c1ff",
              pasteRanges: ["C:C"],
              pasteRangesNumber: ["U:U"],
              header: [
                "ID операции", // 0
                "Тип операции", // 1
                "Дата операции", // 2
                "Название типа операции", // 3
                "Стоимость доставки для начислений по тарифам, до 01/02/2021, + за крупногабаритный товар", // 4
                "Плата за возвраты и отмены для начислений по тарифам, которые действовали до 01/02/2021, + начисления для крупногабаритных товаров", // 5
                "Стоимость товаров с учётом скидок продавца", // 6
                "Комиссия за продажу или возврат комиссии за продажу", // 7
                "Итоговая сумма операции", // 8
                "Тип начисления", // 9
                "Схема доставки", // 10
                "Дата принятия отправления в обработку", // 11
                "Номер отправления", // 12
                "ID склада", // 13
                "Название", // 14
                "Название услуги", // 15
                "Цена", // 16
                "Ozon id", // 17
              ],
              headerGruppedFull: [
                "Дата операции", // 2
                "ID операции", // 0
                "Название типа операции", // 3
                "Номер отправления", // 12
                "Дата принятия отправления в обработку", // 11
                "Схема доставки", // 10
                "Тип начисления", // 9
                "Ozon SKU id", // 17
                "Название", // 14
                "Количество",
                "Стоимость товаров с учётом скидок продавца", // 6
                "Ставка комиссии",
                "Комиссия за продажу или возврат комиссии за продажу", // 7

                "Сборка заказа", // +
                // "Обработка отправления (Drop-off/Pick-up) (разбивается по товарам пропорционально количеству в отправлении)",
                "Обработка отправления (Drop-off/Pick-up)",
                "Магистраль", // +
                // "Последняя миля (разбивается по товарам пропорционально доле цены товара в сумме отправления)", // +
                "Последняя миля", // +
                "Обратная магистраль", // +
                "Обработка возврата", // +
                // "Обработка отмененного или невостребованного товара (разбивается по товарам в отправлении в одинаковой пропорции)",
                "Обработка отмененного или невостребованного товара",
                "Обработка невыкупленного товара",
                "Логистика", // +
                "Обратная логистика", // +

                "Итоговая сумма операции", // 8
              ],
              headerGrupped: [
                "Дата операции", // 2
                "ID операции", // 0
                "Название типа операции", // 3
                "Номер отправления", // 12
                "Дата принятия отправления в обработку", // 11
                "Схема доставки", // 10
                "Тип начисления", // 9
                "Ozon SKU id", // 17
                "Название", // 14
                "Количество",
                "Стоимость товаров с учётом скидок продавца", // 6
                "Ставка комиссии",
                "Комиссия за продажу или возврат комиссии за продажу", // 7
                "Итоговая сумма операции", // 8
              ],
              operationType: {
                ClientReturnAgentOperation:
                  "Получение возврата, отмены, невыкупа от покупателя",
                MarketplaceMarketingActionCostOperation:
                  "Услуги продвижения товаров",
                MarketplaceSaleReviewsOperation:
                  "Приобретение отзывов на платформе",
                MarketplaceSellerCompensationOperation: "Прочие компенсации",
                OperationAgentDeliveredToCustomer: "Доставка покупателю",
                OperationAgentDeliveredToCustomerCanceled:
                  "Доставка покупателю — исправленное начисление",
                OperationAgentStornoDeliveredToCustomer:
                  "Доставка покупателю — отмена начисления",
                OperationClaim: "Начисление по претензии",
                OperationCorrectionSeller: "Инвентаризация взаиморасчетов",
                OperationDefectiveWriteOff:
                  "Компенсация за повреждённый на складе товар",
                OperationItemReturn:
                  "Доставка и обработка возврата, отмены, невыкупа",
                OperationLackWriteOff:
                  "Компенсация за утерянный на складе товар",
                OperationMarketplaceCrossDockServiceWriteOff:
                  "Доставка товаров на склад Ozon (кросс-докинг)",
                OperationMarketplaceServiceStorage:
                  "Услуга размещения товаров на складе",
                OperationSetOff: "Взаимозачёт с другими договорами контрагента",
                MarketplaceSellerReexposureDeliveryReturnOperation:
                  "Перечисление за доставку от покупателя",
                OperationReturnGoodsFBSofRMS:
                  "Доставка и обработка возврата, отмены, невыкупа",
                ReturnAgentOperationRFBS:
                  "Возврат перечисления за доставку покупателю",
                MarketplaceSellerShippingCompensationReturnOperation:
                  "Компенсация перечисления за доставку",
                OperationMarketplaceServicePremiumCashback:
                  "Услуга продвижения Premium",
                OperationMarketplaceServicePremiumPromotion:
                  "Услуга продвижения Premium",
                MarketplaceRedistributionOfAcquiringOperation:
                  "Оплата эквайринга",
                MarketplaceSellerInstallmentOperation: "Ozon Рассрочка",
                OperationMarketplaceServiceStockDisposal: "Утилизация",
                OperationMarketplaceServiceProcessingSpoilageSurplus:
                  "Обработка брака с приемки",
                OperationMarketplaceServiceProcessingNotIdentifiedSurplus:
                  "Обработка неопознанных излишков с приемки",
                OperationMarketplaceServiceProcessingIdentifiedSurplus:
                  "Обработка опознанных излишков с приемки",
                OperationMarketplaceServicePremiumCashbackBonusAccrual:
                  "Услуга продвижения Бонусы продавца - рассылка",
                OperationMarketplaceServicePremiumCashbackIndividualPoints:
                  "Услуга продвижения Бонусы продавца",
                OperationMarketplaceReturnStorageServiceInTheWarehouseFbs:
                  "Начисление за хранение/утилизацию возвратов",
                OperationMarketplaceReturnStorageServiceAtThePickupPointFbs:
                  "Начисление за хранение/утилизацию возвратов",
                OperationMarketplaceServiceEarlyPaymentAccrual:
                  "Услуга досрочной выплаты",
                OperationMarketplacePremiumSubscribtion: "Premium-подписка",
                OperationMarketplaceFlexiblePaymentSchedule:
                  "Начисление за гибкий график выплат",
                MarketplaceSellerCorrectionOperation:
                  "Корректировки стоимости услуг",
                MarketplaceSellerCompensationLossOfGoodsOperation:
                  "Компенсация за уничтоженный товар",
                MarketplaceSaleReviewsItem: "Приобретение отзывов на платформе",
                MarketplaceServicePremiumPromotion:
                  "Услуга продвижения Premium, фиксированная комиссия",
                MarketplaceReturnStorageServiceAtThePickupPointFbsItem:
                  "Краткосрочное размещение возврата FBS",
                MarketplaceReturnStorageServiceInTheWarehouseFbsItem:
                  "Долгосрочное размещение возврата FBS",
                MarketplaceServiceItemDeliveryKGT: "Доставка КГТ",
                MarketplaceServiceItemDirectFlowLogistic: "Логистика",
                MarketplaceServiceItemReturnFlowLogistic: "Обратная логистика",
                MarketplaceServicePremiumCashbackIndividualPoints:
                  "Услуга продвижения «Бонусы продавца»",
                OperationMarketplaceWithHoldingForUndeliverableGoods:
                  "Удержание за недовложение товара",
                MarketplaceSellerCompensationItemOperation:
                  "Компенсации за поврежденный на складе товар",
                OperationWriteOffByUtilizationInDelivery:
                  "Списание по утилизации в доставке",
                OperationMarketplaceSupplyAdditional:
                  "Обработка товара в составе грузоместа на FBO",
                OperationMarketplaceServiceSupplyInboundCargoSurplus:
                  "Услуга по обработке опознанных излишков в составе ГМ",
                OperationMarketplaceServiceSupplyInboundCargoShortage:
                  "Услуга по бронированию места и персонала для поставки с неполным составом в составе ГМ",
                OperationMarketplacePremiumPlusSubscribtion:
                  "Подписка Premium Plus",
                OperationMarketPlaceItemPinReview: "Закрепление отзыва",
                MarketplaceServiceItemDirectFlowLogisticVDC: "Логистика вРЦ",
                MarketplaceServiceItemDropoffPPZ: "Услуга drop-off в ППЗ",
                MarketplaceServicePremiumCashback: "Услуга продвижения Premium",
                OperationMarketplaceAgencyFeeAggregator3PLGlobal:
                  "Тарификация агентской услуги Agregator 3PL Global",
                ItemAgentServiceStarsMembership:
                  "Вознаграждение за услугу 'Звёздные товары'",
                MarketplaceServiceItemRedistributionReturnsPVZ:
                  "Перевыставление возвратов на пункте выдачи",
                OperationElectronicServiceStencil: "Услуга 'Трафареты'",
                OperationElectronicServicesPromotionInSearch:
                  "Услуга 'Продвижение в поиске'",
                OperationMarketplaceServiceItemElectronicServicesBrandShelf:
                  "Услуга 'Брендовая полка'",
                OperationSubscriptionPremium: "Подписка Premium",
              },
              nameServices: {
                MarketplaceNotDeliveredCostItem:
                  "Возврат невостребованного товара от покупателя на склад",
                MarketplaceReturnAfterDeliveryCostItem:
                  "Возврат от покупателя на склад после доставки",
                MarketplaceDeliveryCostItem: "Доставка товара до покупателя",
                MarketplaceSaleReviewsItem: "Приобретение отзывов на платформе",
                ItemAdvertisementForSupplierLogistic:
                  "Доставка товаров на склад Ozon (кросс-докинг)",
                MarketplaceServiceStorageItem: "Размещения товаров",
                OperationMarketplaceServiceStorage: "Размещения товаров",
                MarketplaceMarketingActionCostItem: "Продвижение товаров",
                MarketplaceServiceItemInstallment:
                  "Продвижению и продажа в рассрочку",
                MarketplaceServiceItemMarkingItems:
                  "Обязательная маркировка товаров",
                MarketplaceServiceItemFlexiblePaymentSchedule:
                  "Гибкий график выплат",
                MarketplaceServiceItemReturnFromStock:
                  "Комплектация товаров для вывоза продавцом",
                ItemAdvertisementForSupplierLogisticSeller:
                  "Транспортно-экспедиционные услуги",
                MarketplaceServiceItemDelivToCustomer: "Последняя миля",
                MarketplaceServiceItemDirectFlowTrans: "Магистраль",
                MarketplaceServiceItemDropoffFF: "Обработка отправления",
                MarketplaceServiceItemDropoffPVZ: "Обработка отправления",
                MarketplaceServiceItemDropoffSC: "Обработка отправления",
                MarketplaceServiceItemFulfillment: "Сборка заказа",
                MarketplaceServiceItemPickup:
                  "Выезд тс по адресу продавца для забора отправлений (Pick-up)",
                MarketplaceServiceItemReturnAfterDelivToCustomer:
                  "Обработка возврата",
                MarketplaceServiceItemReturnFlowTrans: "Обратная магистраль",
                MarketplaceServiceItemReturnNotDelivToCustomer:
                  "Обработка отмен",
                MarketplaceServiceItemReturnFlowLogistic: "Обратная логистика",
                MarketplaceServiceItemReturnPartGoodsCustomer:
                  "Обработка невыкупа",
                MarketplaceRedistributionOfAcquiringOperation:
                  "Оплата эквайринга",
                MarketplaceServicePremiumPromotion:
                  "Услуга продвижение Premium, фиксированная комиссия",
                MarketplaceReturnStorageServiceAtThePickupPointFbsItem:
                  "Краткосрочное размещение возврата FBS",
                MarketplaceReturnStorageServiceInTheWarehouseFbsItem:
                  "Долгосрочное размещение возврата FBS",
                MarketplaceServiceItemDeliveryKGT:
                  "Доставка крупногабаритного товара (КГТ)",
                MarketplaceServiceItemDirectFlowLogistic: "Логистика",
                MarketplaceServicePremiumCashbackIndividualPoints:
                  "Услуга продвижения Бонусы продавца",
                OperationMarketplaceWithHoldingForUndeliverableGoods:
                  "Удержание за недовложение товара",
                MarketplaceServiceItemDirectFlowLogisticVDC: "Логистика в РЦ",
                MarketplaceServiceItemDropoffPPZ: "Услуги drop off на ППЗ",
                MarketplaceServicePremiumCashback: "Услуга продвижения Premium",
                MarketplaceServiceItemRedistributionReturnsPVZ:
                  "Перевыставление возвратов на ПВЗ",
                OperationMarketplaceAgencyFeeAggregator3PLGlobal:
                  "Тарификация агентской услуги Agregator 3PL Global",
                ItemAgentServiceStarsMembership:
                  "Вознаграждение за услугу 'Звёздные товары'",
              },
              transactionType: {
                all: "Все",
                orders: "Заказы",
                returns: "Возвраты и отмены",
                services: "Сервисные сборы",
                compensation: "Компенсация",
                transferDelivery: "Стоимость доставки",
                other: "Прочее",
              },
            },
            transactionTotals: {
              sheet: "Суммы транзакций",
              range: "A1:ZZ",
              sheetColor: "#00c1ff",
              header: [
                "Дата отчета с",
                "Дата отчета по",
                "Общая стоимость товаров и возвратов в заданный период",
                "Компенсации",
                "Начисления за доставку и возвраты при работе по схеме «Доставка по выбору продавца»",
                "Прочие начисления",
                "Стоимость услуг обработки отправлений, сборки заказов, магистрали и последней мили, + доставки до 01/02/2021",
                "Стоимость обратной магистрали, обработки возвратов, отмен и невыкупа товара, + возвратов до 01/02/2021",
                "Сумма комиссии, которая была удержана при продаже товара и возвращена при его возврате",
                "Стоимость дополнительных услуг, не связанных напрямую с доставками и возвратами товаров",
              ],
            },
            b2bSales: {
              sheet: "Реестр продаж юр. лицам",
              range: "A1:ZZ",
              sheetColor: "#00c1ff",
              header: [
                "Дата отчета с",
                "Дата отчета по",
                "Общая стоимость товаров и возвратов в заданный период",
                "Компенсации",
                "Начисления за доставку и возвраты при работе по схеме «Доставка по выбору продавца»",
                "Прочие начисления",
              ],
            },
            mutualSettlement: {
              sheet: "Отчёт о взаиморасчётах",
              range: "A1:ZZ",
              sheetColor: "#00c1ff",
              header: [
                "Дата отчета с",
                "Дата отчета по",
                "Общая стоимость товаров и возвратов в заданный период",
                "Компенсации",
                "Начисления за доставку и возвраты при работе по схеме «Доставка по выбору продавца»",
                "Прочие начисления",
              ],
            },
            compensation: {
              sheet: "Отчёт о компенсациях",
              range: "A1:ZZ",
              sheetColor: "#00c1ff",
              header: [],
            },
            decompensation: {
              sheet: "Отчёт о декомпенсациях",
              range: "A1:ZZ",
              sheetColor: "#00c1ff",
              header: [],
            },
          },
        },
      },
      performance: {
        sheetColor: "GREEN",
        campaigns: {
          sheet: "РК Список",
          rangesDateTime: ["A:A", "O:P"],
          rangesDates: ["F:G"],
          header: {
            updated: "Обновлено",
            id: "ID кампании",
            title: "Название кампании",
            state: "Статус",
            advObjectType: "Тип РК",
            fromDate: "Дата старта РК",
            toDate: "Дата завершения РК",
            budget: "Бюджет РК",
            dailyBudget: "Дневной бюджет РК",
            weeklyBudget: "Недельный бюджет РК",
            budgetType: "Тип бюджета",

            placement: "Место размещения рекламы",
            expenseStrategy: "Стратегия расходов",

            PaymentType: "Тип оплаты",
            createdAt: "Дата создания",
            updatedAt: "Дата обновления",

            // startWeekDay: "День недели старт",
            // endWeekDay: "День недели финишь",
            weekDays: "Дни недели",

            productCampaignMode: "Режим создания и управления",

            productAutopilotStrategy: "Автостратегия РК",
            categoryId: "ID категории товаров",
            skuAddMode: "Автостратегия",
            // maxBid: "",
            // brands: "",
            // priceMin: "",
            // priceMax: "",
            // availability: "",
            // sourceType: "",
            // notInOtherCampaigns: "",
            // withDiscount: "",
            // availability: "",
          },
        },
        limitsList: {
          sheet: "РК Лимиты ставок",
          rangesDateTime: ["A:A"],
          header: {
            updatedAt: "Обновлено",
            category: "Категория товара",
            bid: "Ставка в руб.",
            maxBid: "Max ставка в руб.",
            minBid: "Min ставка в руб.",
            objectType: "Тип инструмента",
            paymentMethod: "Способ оплаты",
            placement: "Тип РК",
          },
        },
        video: {
          sheet: "РК По показам видеобаннера",
          rangesDates: ["E:F"],
          header: [
            "ID кампании",
            "Название",
            "Формат",
            "Статус",
            "Дневной бюджет, ₽",
            "Бюджет, ₽",
            "Приоритет",
            "Расход, ₽",
            "Показы",
            "Клики",
            "Средняя ставка, ₽",
            "Ср. цена 1000 показов, %!s(MISSING)",
            "CTR, %",
            "Ср. цена клика, ₽%!(EXTRA string=₽)",
            "Заказы, шт.",
            "Заказы, ₽",
            "ДРР",
            "Тип РК",
          ],
        },
        media: {
          sheet: "РК По медийным",
          rangesDates: ["E:F"],
          header: {
            id: "ID кампании",
            title: "Название",
            objectType: "Формат",
            status: "Статус",
            dailyBudget: "Дневной бюджет, ₽",
            budget: "Бюджет, ₽",
            budgetType: "Тип бюджета",
            moneySpent: "Расход, ₽",
            views: "Показы",
            clicks: "Клики",
            viewPrice: "Ср. цена 1000 показов, %!s(MISSING)",
            ctr: "CTR, %",
            clickPrice: "Ср. цена клика, ₽%!(EXTRA string=₽)",
            orders: "Заказы, шт.",
            ordersMoney: "Заказы, ₽",
            drr: "ДРР (доля рекламных расходов)",
            postViewOrders: "Заказы, шт postview",
            postViewOrdersSum: "Сумма заказов postview",
            paymentMethod: "Тип оплаты",
            // "Тип РК",
          },
        },
        skuAttribution: {
          sheet: "РК По заказам (Баннеры)", // Отчёт по заказам на баннеры
          keys: [
            "sku",
            "title",
            "orders",
            "ordersMoney",
            "models",
            "modelsMoney",
            "attributionType",
          ],
          header: [
            "Период",
            "ID кампании",
            "Ozon SKU id",
            "Название",
            "Заказы, шт.",
            "Заказы, ₽",
            "Заказы модели, шт.",
            "Заказы модели, ₽",
            "attributionType",
          ],
        },
        skuProduct: {
          sheet: "РК Оплата за клик и Спецразмещение",
          header: [
            "Период",
            "ID кампании",
            "Название",
            "Тип РК",
            "Статус",
            "Места размещения для Спецразмещения",
            "Бюджет недельный, ₽",
            "Бюджет, ₽",
            "Расход, ₽",
            "Показы",
            "Клики",
            "CTR, %",
            "Ср. цена клика, ₽",
            "Заказы, шт.",
            "Заказы, ₽",
            "ДРР (доля рекламных расходов)",
            "Добавлений товара в корзину",
            "Автостратегия",
          ],

        },
        expense: {
          sheet: "РК По расходу",
          rangesDateTime: ["A:A"],
          rangesDates: ["D:D"],
          header: [
            "Обновлено",
            "ID кампании",
            "Название",
            "Дата",
            "Расход",
            "Расход бонусов",
            "Расход с абонентского счета",
            "Тип РК",
          ],
        },
        daily: {
          sheet: "РК Дневная статистика",
          rangesDateTime: ["A:A"],
          rangesDates: ["D:D"],
          header: [
            "Обновлено",
            "ID кампании",
            "Название",
            "Дата",
            "Показы",
            "Клики",
            "Расход, ₽",
            "Заказы, шт.",
            "Заказы, ₽",
            "Тип РК",
          ],
        },
        searchPromoOrders: {
          sheet: "РК По заказам (Оплата за заказ)",
          rangesDates: ["A:A"],
          header: {
            date: "Дата заказа",
            orderId: "ID заказа",
            orderNumber: "Номер заказа",
            sku: "Ozon SKU id",
            advSku: "Ozon SKU id продвигаемого товара",
            offerId: "Артикул",
            title: "Название",
            quantity: "Кол-во",
            price: "Цена продажи, ₽",
            cost: "Стоимость, ₽",
            bid: "Ставка, %",
            bidValue: "Ставка, ₽",
            moneySpent: "Расход, ₽",
            ordersSource: "Источник заказа",
          },
        },
        searchPromoProducts: {
          sheet: "РК По товарам (Оплата за заказ)",
          rangesDates: ["G:G"],
          header: {
            period: "Период",
            sku: "Ozon SKU id",
            offerId: "Артикул",
            product_name: "Название",
            category: "Категория",
            promotion_status: "Статус продвижения",
            promotionStatusChangedAt: "Дата изменения статуса",
            price: "Цена продажи, ₽",
            bid: "Ставка, %",
            bidValue: "Ставка, ₽",
            orders: "Кол-во заказов",
            ordersMoney: "Сумма заказов, ₽",
            moneySpent: "Расход, ₽",
            drr: "ДРР, %",
            // coverage: "Охват, %",
            views: "Показы",
            clicks: "Клики",
            ctr: "CTR, %",
            toCart: "Добавлений в корзину",
            moneySpentFromCPC: "Расход, ₽ (за клик)",
            ordersFromCPC: "Заказы, шт. (за клик)",
            ordersMoneyFromCPC: "Заказы, ₽ (за клик)",
          },
        },
        stat: {
          sheet: "РК Статистика",
          rangesDates: ["B:B"],
          campaignsChunkSize: 10,
          headers: {
            // "Оплата за клик" +
            SKU: {
              keys: [
                "date",
                "sku",
                "title",
                "price",
                "views",
                "clicks",
                "ctr",
                "avgBid",
                "moneySpent",
                "orders",
                "ordersMoney",
                "models",
                "modelsMoney",
                "toCart",
                "placement",
              ],
              header: [
                "ID кампании",
                "День",
                "Ozon SKU id",
                "Название",
                "Цена товара, ₽",
                "Показы",
                "Клики",
                "CTR (%)",
                "Ср. цена клика, ₽",
                "Расход, ₽ с НДС",
                "Заказы, шт.",
                "Выручка, ₽",
                "Заказы модели",
                "Выручка с заказов модели, ₽",
                "Добавлений в корзину",
                "Место размещения рекламы",
              ],
            },
            // "Оплата за заказ" +
            SEARCH_PROMO: {
              keys: [
                "date",
                "sku",
                "advSku",
                "title",
                "orderId",
                "orderNumber",
                "offerId",
                "quantity",
                "price",
                "salePrice",
                "cost",
                "bid",
                "bidValue",
                "moneySpent",
              ],
              header: [
                "ID кампании",
                "День",
                "Ozon SKU id",
                "advSku",
                "Название",
                "orderId",
                "orderNumber",
                "offerId",
                "quantity",
                "Цена товара, ₽",
                "salePrice",
                "cost",
                "bid",
                "bidValue",
                "moneySpent",
              ],
            },
            // "Баннерная"
            BANNER: {
              keys: [
                "date",
                "banner",
                "pageType",
                "conditionType",
                "attributesPlatform",
                "views",
                "clicks",
                "ctr",
                "reach",
                "moneySpent",
                "avgBid",
                "title",
              ],
            },
            // "Видео баннер"
            VIDEO_BANNER: {
              keys: [
                "date",
                "banner",
                "iabViews",
                "views",
                "clicks",
                "reach",
                "ctr",
                "iabViewsRatio",
                "viewsQ25",
                "viewsQ50",
                "viewsQ75",
                "viewsQ100",
                "viewsQ25Ratio",
                "viewsQ50Ratio",
                "viewsQ75Ratio",
                "viewsQ100Ratio",
                "viewsWithSound",
                "orders",
                "moneySpent",
                "title",
              ],
              header: [
                "ID кампании",
                "День",
                "ID баннера",
                "Видимые показы",
                "Показы",
                "Клики",
                "Охват",
                "CTR",
                "Доля видимых показов",
                "Досмотры по квартилям: 25%",
                "Досмотры по квартилям: 50%",
                "Досмотры по квартилям: 75%",
                "Досмотры по квартилям: 100%",
                "Доля досмотров: 25%",
                "Доля досмотров: 50%",
                "Доля досмотров: 75%",
                "Доля досмотров: 100%",
                "Просмотры со звуком",
                "Заказы",
                "Расход",
              ],
            },
            // "Брендовая полка" + @deprecated
            BRAND_SHELF: {
              keys: [
                "date",
                "conditionType",
                "displayCondition",
                // "search_query",
                "attributesPlatform",
                "views",
                "clicks",
                "ctr",
                "reach",
                "moneySpent",
                "avgBid",
              ],
              header: [
                "ID кампании",
                "День",
                "conditionType",
                "displayCondition",
                "attributesPlatform",
                "Показы",
                "Клики",
                "CTR (%)",
                "reach",
                "moneySpent",
                "avgBid",
              ],
            },
            // "Продвижение в поиске"
            BOOSTING_SKU: {
              header: [
                "ID кампании",
                "День",
                "Ozon SKU id",
                "Название",
                "Цена товара, ₽",
                "Показы",
                "Клики",
                "CTR (%)",
                "Конверсия",
                "Ср. цена клика, ₽",
                "Расход, ₽ с НДС",
                "Заказы, шт.",
                "Выручка, ₽",
                "Заказы модели",
                "Выручка с заказов модели, ₽",
              ],
            },
            // "РК для акции"
            ACTION_CAS: {
              header: [
                "ID кампании",
                "День",
                "Ozon SKU id",
                "Название",
                "Цена товара, ₽",
                "Показы",
                "Клики",
                "CTR (%)",
                "Конверсия",
                "Ср. цена клика, ₽",
                "Расход, ₽ с НДС",
                "Заказы, шт.",
                "Выручка, ₽",
                "Заказы модели",
                "Выручка с заказов модели, ₽",
              ],
            },
            // "Amplify.ru"
            PROMO_PACKAGE_SERVICE: {
              keys: [
                "date",
                "views",
                "clicks",
                "ctr",
                "moneySpent",
                "avgBid",
                "orders",
                "ordersMoney",
                "models",
                "modelsMoney",
              ],
              header: [
                "ID кампании",
                "День",
                "views",
                "clicks",
                "ctr",
                "moneySpent",
                "avgBid",
                "orders",
                "ordersMoney",
                "models",
                "modelsMoney",
              ],
            },
          },
        },
      },
    },
    menu: {
      title: "🔽 Ozon",
      karandaev(options = {}) {
        const { moysklad } = options;
        var ui = SpreadsheetApp.getUi();
        var menu = ui
          .createMenu(`${this.title}`)
          .addItem("1️⃣ Список отправлений FBO (заказы)", "fboPostingList") // !
          .addItem("2️⃣ Список отправлений FBS (заказы)", "fbsPostingList") // !
          .addSeparator()
          .addSubMenu(
            ui
              .createMenu("Товары, остатки, возвраты")
              .addItem("Отчёт по товарам", "reportProducts") // !
              .addItem("Фото товаров", "productsPhoto") // !
              .addSeparator()
              .addItem("Остатки FBO/FBS", "stocksAll") // !
              .addSeparator()
              .addSubMenu(
                ui
                  .createMenu("Остатки FBO")
                  .addItem(
                    "Отчёт по остаткам и товарам FBO (будет отключён, используйте Аналитика по остаткам FBO)",
                    "analyticsStockOnWarehousesReport"
                  ) // !
                  .addSeparator()
                  .addItem("Аналитика по остаткам FBO", "analyticsStocks") // !
                  .addItem("Кластеры FBO", "fboClusterList") // !
              )
              .addSeparator()
              .addSubMenu(
                ui
                  .createMenu("Остатки FBS")
                  .addItem("Остатки FBS и rFBS", "stocksByWarehouseFbs") // !
                  .addItem("Отчёт об остатках FBS", "reportWarehouseStock") // !
              )
          )
          .addSeparator()
          .addSubMenu(
            ui
              .createMenu("Отчёты")
              .addItem(
                "Список транзакций (начисления)",
                "financeTransactionListLoadGrupped"
              ) // !
              .addSeparator()
              .addItem("Данные аналитики", "analyticsDataReport") // !
          )
          .addSeparator()
          .addSubMenu(
            ui
              .createMenu("Реклама")
              .addItem("РК Список", "pfCampaigns")
              .addItem("РК По расходу", "pfExpense")
              .addItem("РК Дневная статистика", "pfDaily")
              .addSeparator()
              .addItem("РК Статистика (Оплата за клик)", "pfStatSku")
              .addItem("РК Статистика (Оплата за заказ)", "pfStatSearchPromo")
              .addItem("РК Статистика (Баннерная)", "pfStatBanners")
            // .addItem("РК Статистика (Брендовая полка)", "pfStatBrendSelf")
            // .addItem("РК Статистика (Видеобаннеры)", "pfStatVideoBanners")
          )
          .addSeparator()
          .addSubMenu(
            ui
              .createMenu("⚙️ Настройки")
              .addSubMenu(
                ui
                  .createMenu("Доступ")
                  .addItem("🔑 Seller API", "ozonSetSellerAccess")
                  .addSeparator()
                  .addItem("🔑 Performance API", "ozonSetPerformanceAccess")
              )
              .addSeparator()
              .addSubMenu(
                ui
                  .createMenu("⏳ Автообновление")
                  .addSubMenu(
                    ui
                      .createMenu("Seller API")
                      .addItem("Список отправлений FBO", "Ozon.trigger2")
                      .addItem("Список отправлений FBS", "Ozon.trigger3")
                      .addSeparator()
                      .addSubMenu(
                        ui
                          .createMenu("Остатки, товары")
                          .addItem("Отчёт по товарам", "Ozon.trigger8")
                          .addSeparator()
                          .addItem(
                            "Остатки FBO/FBS (раз в 30 мин.)",
                            "Ozon.trigger1"
                          )
                          .addSeparator()
                          .addItem(
                            "Отчёт по остаткам и товарам FBO (раз в час.)",
                            "Ozon.trigger9"
                          )
                          .addSeparator()
                          .addItem(
                            "Аналитика по остаткам FBO (раз в час.)",
                            "Ozon.trigger20"
                          )
                          .addSeparator()
                          .addItem("Отчёт об остатках FBS", "Ozon.trigger10")
                          .addItem(
                            "Остатки FBS и rFBS(раз в час.)",
                            "Ozon.trigger26"
                          )
                      )
                      .addSeparator()
                      .addSubMenu(
                        ui
                          .createMenu("Отчёты")
                          .addItem("Список транзакций", "Ozon.trigger17")
                          .addSeparator()
                          .addItem("Данные аналитики", "Ozon.trigger5")
                      )
                  )
                  .addSeparator()
                  .addSubMenu(
                    ui
                      .createMenu("Performance API")
                      .addItem(
                        "✅ Подключить (блок ниже)",
                        "Ozon.triggerPerformance"
                      )
                      .addSeparator()
                      .addItem("РК Список", "Ozon.triggerPerformance1")
                      .addItem("РК По расходу", "Ozon.triggerPerformance2")
                      .addItem(
                        "РК Дневная статистика",
                        "Ozon.triggerPerformance3"
                      )
                      .addSeparator()
                      .addItem(
                        "РК Статистика (Оплата за клик)",
                        "Ozon.triggerPerformance4"
                      )
                      .addItem(
                        "РК Статистика (Оплата за заказ)",
                        "Ozon.triggerPerformance5"
                      )
                  )
                  .addSeparator()
                  .addItem("✅ Установить (все)", "Ozon.triggersKarandaev")
                  .addSeparator()
                  .addItem("❌ Удалить все", "Ozon.deleteTriggers")
              )
              .addSeparator()
              .addItem("🅰️ Текущая версия", "Ozon.ozonLibraryVersion")
              .addSeparator()
              .addSubMenu(
                ui
                  .createMenu("📄 Листы")
                  .addItem("Список", "Ozon.getSheetsInBook")
                  .addItem("Сортировать", "Ozon.sortSheetsInBook")
                  .addItem("Показать", "Ozon.showSheetsInBook")
                  .addItem("Скрыть", "Ozon.hideSheetsInBook")
                  .addItem("❗️Удалить", "Ozon.deleteSheetsInBook")
                  .addSeparator()
                  .addItem("Очистка перед выгрузкой", "Ozon.clearReportSheets")
                  .addItem("Очистить активный", "Ozon.clear")
                  .addSeparator()
                  .addItem("Копировать активный", "Ozon.copyActiveSheet")
              )
          );

        if (moysklad) {
          menu = this.moysklad(menu, ui);
        }

        menu.addToUi();
      },
      full(options = {}) {
        const { moysklad } = options;
        var ui = SpreadsheetApp.getUi();
        var menu = ui
          .createMenu(`${this.title}`)
          .addItem("1️⃣ Список отправлений FBO (заказы)", "fboPostingList")
          .addItem("2️⃣ Список отправлений FBS (заказы)", "fbsPostingList")
          .addSeparator()
          .addSubMenu(
            ui
              .createMenu("Товары, остатки, возвраты")
              .addItem("Отчёт по товарам", "reportProducts")
              .addItem("Фото товаров", "productsPhoto")
              .addItem("Отчёт об уценённых товарах", "reportDiscounted")
              .addSeparator()
              .addItem("Остатки FBO/FBS", "stocksAll")
              .addSeparator()
              .addSubMenu(
                ui
                  .createMenu("Остатки FBO")
                  .addItem(
                    "Отчёт по остаткам и товарам FBO (будет отключён, используйте Аналитика по остаткам FBO)",
                    "analyticsStockOnWarehousesReport"
                  )
                  .addSeparator()
                  .addItem("Аналитика по остаткам FBO", "analyticsStocks")
                  .addItem(
                    "Оборачиваемость товара FBO",
                    "analyticsTurnoverStocksReport"
                  )
                  .addSeparator()
                  .addItem("Загруженность складов FBO", "warehousesAvailable")
                  .addSeparator()
                  .addItem("Кластеры FBO", "fboClusterList")
              )
              // .addSeparator()
              // .addSubMenu(
              //   ui
              //     .createMenu("Поставки FBO")
              //     .addItem(
              //       "⚙️ Поставки FBO выбрать статусы...",
              //       "Ozon.emtyMenu"
              //     )
              //     .addItem(
              //       "1️⃣ Информация о заявке на поставку",
              //       "fboSupplyOrderList"
              //     )
              //     .addItem("⚙️ Поставки FBO выбрать заявки...", "Ozon.emtyMenu")
              //     .addItem(
              //       "2️⃣ Состав поставки или заявки на поставку",
              //       "fboSupplyOrderBundle"
              //     )
              //     .addSeparator()
              //     .addItem(
              //       "Количество заявок по статусам",
              //       "fboSupplyOrderCount"
              //     )
              //     .addSeparator()
              //     .addItem("Загруженность складов FBO", "warehousesAvailable")
              //     .addSeparator()
              //     .addItem("Кластеры FBO", "fboClusterList")
              // )
              .addSeparator()
              .addSubMenu(
                ui
                  .createMenu("Остатки FBS")
                  .addItem("Остатки FBS и rFBS", "stocksByWarehouseFbs")
                  .addItem("Отчёт об остатках FBS", "reportWarehouseStock")
                  .addSeparator()
                  .addItem("Cписок складов FBS", "wherehouses")
              )
              .addSeparator()
              .addSubMenu(
                ui
                  .createMenu("Возвраты")
                  .addItem("Возвраты FBO и FBS", "fboFbsReturnsList")
                  .addItem("Возвраты rFBS", "rfbsReturns")
                  // удалить
                  .addSeparator()
                  .addItem("Отчёт о возвратах FBO и FBS", "reportReturns")
              )
          )
          .addSeparator()
          .addSubMenu(
            ui
              .createMenu("Цены")
              .addItem("Цены", "prices")
              .addItem("Цены (всё)", "pricesFull")
          )
          .addSeparator()
          .addSubMenu(
            ui
              .createMenu("Отчёты")
              .addItem("1️⃣ Отчёт об отправлениях FBO", "reportPostingsFbo")
              .addItem("2️⃣ Отчёт об отправлениях FBS", "reportPostingsFbs")
              .addSeparator()
              .addItem("Финансовый отчёт", "reportCashFlowStatement")
              .addItem(
                "Финансовый отчёт (расшифровка)",
                "reportCashFlowStatementWithDetails"
              )
              .addSeparator()
              .addItem(
                "Список транзакций (начисления)",
                "financeTransactionListLoadGrupped"
              )
              .addItem("Отчёт о реализации", "financeRealizations")
              .addItem(
                "Позаказный отчёт о реализации товаров",
                "financeRealizationsPostings"
              )
              .addSeparator()
              .addItem("Данные аналитики", "analyticsDataReport")
          )
          // .addSeparator()
          // .addSubMenu(
          //   ui
          //     .createMenu("Premium")
          //     .addItem("Данные аналитики", "analyticsDataReport")
          // )
          .addSeparator()
          .addSubMenu(
            ui
              .createMenu("Акции")
              .addItem("1️⃣ Список акций", "actionsList")
              .addItem(
                "2️⃣ Список доступных для акции товаров",
                "actionsCandidates"
              )
              .addItem("3️⃣ Список товаров в акциях", "actionsProducts")
              .addSeparator()
              .addItem("✅ Добавить в акции", "actionsActivate")
              .addItem("❌ Удалить из акций", "actionsDeactivate")
          )
          .addSeparator()
          .addSubMenu(
            ui
              .createMenu("Реклама")
              .addItem("РК Список", "pfCampaigns")
              .addItem("РК Лимиты ставок", "pfLimitsList")
              .addItem("РК По расходу", "pfExpense")
              .addItem("РК Дневная статистика", "pfDaily")
              .addSeparator()
              .addItem("РК Оплата за клик и Спецразмещение", "pfSkuProduct")
              .addItem("РК По заказам (Оплата за заказ)", "pfSearchPromoOrders")
              .addItem(
                "РК По товарам (Оплата за заказ)",
                "pfSearchPromoProducts"
              )
              .addSeparator()
              .addItem("РК Статистика (Оплата за клик)", "pfStatSku")
              .addItem("РК Статистика (Оплата за заказ)", "pfStatSearchPromo")
              .addItem("РК Статистика (Баннерная)", "pfStatBanners")
            // .addItem("РК Статистика (Брендовая полка)", "pfStatBrendSelf")
            // .addItem("РК Статистика (Видеобаннеры)", "pfStatVideoBanners")
          )
          .addSeparator()
          .addSubMenu(
            ui
              .createMenu("⚙️ Настройки")
              .addSubMenu(
                ui
                  .createMenu("Доступ")
                  .addItem("🔑 Seller API", "ozonSetSellerAccess")
                  .addSeparator()
                  .addItem("🔑 Performance API", "ozonSetPerformanceAccess")
              )
              .addSeparator()
              .addSubMenu(
                ui
                  .createMenu("⏳ Автообновление")
                  .addSubMenu(
                    ui
                      .createMenu("Seller API")
                      .addItem(
                        "Список отправлений FBO (раз в час.)",
                        "Ozon.trigger2"
                      )
                      .addItem(
                        "Список отправлений FBS (раз в час.)",
                        "Ozon.trigger3"
                      )
                      .addSeparator()
                      .addSubMenu(
                        ui
                          .createMenu("Остатки, товары")
                          .addItem("Отчёт по товарам", "Ozon.trigger8")
                          .addSeparator()
                          .addItem(
                            "Остатки FBO/FBS (раз в 30 мин.)",
                            "Ozon.trigger1"
                          )
                          .addItem("Остатки FBO/FBS (23-00)", "Ozon.trigger22")
                          .addSeparator()
                          .addItem(
                            "Отчёт по остаткам и товарам FBO (раз в час.)",
                            "Ozon.trigger9"
                          )
                          .addItem(
                            "Отчёт по остаткам и товарам FBO (23-00)",
                            "Ozon.trigger23"
                          )
                          .addSeparator()
                          .addItem(
                            "Аналитика по остаткам FBO (раз в час.)",
                            "Ozon.trigger20"
                          )
                          // .addItem(
                          //   "Аналитика по остаткам FBO (23-00)",
                          //   "analyticsStocks"
                          // )
                          .addSeparator()
                          .addItem("Отчёт об остатках FBS", "Ozon.trigger10")
                          .addItem(
                            "Остатки FBS и rFBS(раз в час.)",
                            "Ozon.trigger26"
                          )
                          .addSeparator()
                          .addItem("Возвраты FBO и FBS", "Ozon.trigger19")
                          .addItem("Возвраты rFBS", "Ozon.trigger21")
                      )
                      .addSeparator()
                      .addSubMenu(
                        ui
                          .createMenu("Цены")
                          .addItem("Цены (раз в 2 часа)", "Ozon.trigger13")
                          .addItem("Цены (23-00)", "Ozon.trigger24")
                          .addItem("Цены (всё)", "Ozon.trigger16")
                      )
                      .addSeparator()
                      .addSubMenu(
                        ui
                          .createMenu("Отчёты")
                          .addItem(
                            "Отчёт об отправлениях FBO",
                            "Ozon.trigger14"
                          )
                          .addItem(
                            "Отчёт об отправлениях FBS",
                            "Ozon.trigger15"
                          )
                          .addSeparator()
                          .addItem("Список транзакций", "Ozon.trigger17")
                          .addSeparator()
                          .addItem("Финансовый отчёт", "Ozon.trigger6")
                          .addItem(
                            "Финансовый отчёт (расшифровка)",
                            "Ozon.trigger11"
                          )
                          .addSeparator()
                          .addItem("Отчёт о реализации", "Ozon.trigger7")
                          .addItem(
                            "Позаказный отчёт о реализации товаров",
                            "Ozon.trigger25"
                          )
                          .addItem("Данные аналитики", "Ozon.trigger5")
                      )
                  )
                  .addSeparator()
                  .addSubMenu(
                    ui
                      .createMenu("Performance API")
                      .addItem(
                        "✅ Подключить (блок ниже)",
                        "Ozon.triggerPerformance"
                      )
                      .addSeparator()
                      .addItem("РК Список", "Ozon.triggerPerformance1")
                      .addItem("РК По расходу", "Ozon.triggerPerformance2")
                      .addItem(
                        "РК Дневная статистика",
                        "Ozon.triggerPerformance3"
                      )
                      .addSeparator()
                      .addItem(
                        "РК Статистика (Оплата за клик)",
                        "Ozon.triggerPerformance4"
                      )
                      .addItem(
                        "РК Статистика (Поисковая промо)",
                        "Ozon.triggerPerformance5"
                      )
                  )
                  .addSeparator()
                  .addItem("❌ Удалить все", "Ozon.deleteTriggers")
              )
              .addSeparator()
              .addItem("🅰️ Текущая версия", "Ozon.ozonLibraryVersion")
              .addSeparator()
              .addSubMenu(
                ui
                  .createMenu("📄 Листы")
                  .addItem("Список", "Ozon.getSheetsInBook")
                  .addItem("Сортировать", "Ozon.sortSheetsInBook")
                  .addItem("Показать", "Ozon.showSheetsInBook")
                  .addItem("Скрыть", "Ozon.hideSheetsInBook")
                  .addItem("❗️Удалить", "Ozon.deleteSheetsInBook")
                  .addSeparator()
                  .addItem("Очистка перед выгрузкой", "Ozon.clearReportSheets")
                  .addItem("Очистить активный", "Ozon.clear")
                  .addSeparator()
                  .addItem("Копировать активный", "Ozon.copyActiveSheet")
              )
          );

        if (moysklad) {
          menu = this.moysklad(menu, ui);
        }

        menu.addToUi();
      },
      fbo(options = {}) {
        const { moysklad } = options;
        var ui = SpreadsheetApp.getUi();
        var menu = ui
          .createMenu(`${this.title}`)
          .addItem("Список отправлений FBO (заказы)", "fboPostingList")
          .addSeparator()
          .addItem("Возвраты FBO и FBS", "fboFbsReturnsList")
          .addSeparator()
          .addSubMenu(
            ui
              .createMenu("Остатки, цены")
              .addItem("Отчёт по товарам", "reportProducts")
              .addSeparator()
              .addItem("Остатки FBO/FBS", "stocksAll")
              .addSeparator()
              .addItem("Остатки по FBO", "stocksFbo")
              .addItem(
                "Отчёт по остаткам и товарам FBO (будет отключён, используйте Аналитика по остаткам FBO)",
                "analyticsStockOnWarehousesReport"
              )
              .addItem("Аналитика по остаткам FBO", "analyticsStocks")
              .addItem(
                "Оборачиваемость товара FBO",
                "analyticsTurnoverStocksReport"
              )
              .addItem("Кластеры FBO", "fboClusterList")
              .addSeparator()
              .addItem("Загруженность складов FBO", "warehousesAvailable")
              .addSeparator()
              .addItem("Цены", "prices")
              .addItem("Цены (всё)", "pricesFull")
          )
          .addSeparator()
          .addSubMenu(
            ui
              .createMenu("Отчёты")
              .addItem("Отчёт об отправлениях FBO", "reportPostingsFbo")
              .addSeparator()
              .addItem("Финансовый отчёт", "reportCashFlowStatement")
              .addItem(
                "Финансовый отчёт (расшифровка)",
                "reportCashFlowStatementWithDetails"
              )
              .addSeparator()
              .addItem("Список транзакций", "financeTransactionListLoadGrupped")
              .addItem("Отчёт о реализации", "financeRealizations")
              .addSeparator()
              .addItem("Данные аналитики", "analyticsDataReport")
          )
          .addSeparator()
          .addSubMenu(
            ui
              .createMenu("Реклама")
              .addItem("РК Список", "pfCampaigns")
              .addItem("РК Лимиты ставок", "pfLimitsList")
              .addItem("РК По расходу", "pfExpense")
              .addItem("РК Дневная статистика", "pfDaily")
              .addSeparator()
              .addItem("РК Оплата за клик и Спецразмещение", "pfSkuProduct")
              .addItem("РК По заказам (Оплата за заказ)", "pfSearchPromoOrders")
              .addItem(
                "РК По товарам (Оплата за заказ)",
                "pfSearchPromoProducts"
              )
              .addSeparator()
              .addItem("РК Статистика (Оплата за клик)", "pfStatSku")
              .addItem("РК Статистика (Оплата за заказ)", "pfStatSearchPromo")
              .addItem("РК Статистика (Баннерная)", "pfStatBanners")
            // .addItem("РК Статистика (Брендовая полка)", "pfStatBrendSelf")
            // .addItem("РК Статистика (Видеобаннеры)", "pfStatVideoBanners")
          )
          .addSeparator()
          .addSubMenu(
            ui
              .createMenu("⚙️ Настройки")
              .addSubMenu(
                ui
                  .createMenu("Доступ")
                  .addItem("🔑 Seller API", "ozonSetSellerAccess")
                  .addSeparator()
                  .addItem("🔑 Performance API", "ozonSetPerformanceAccess")
              )
              .addSeparator()
              .addSubMenu(
                ui
                  .createMenu("⏳ Автообновление")
                  .addSubMenu(
                    ui
                      .createMenu("Seller API")
                      .addItem("Список отправлений FBO", "Ozon.trigger2")
                      .addSeparator()
                      .addItem("Отчёт об отправлениях FBO", "Ozon.trigger14")
                      .addSeparator()
                      .addItem("Возвраты FBO и FBS", "Ozon.trigger19")
                      .addSeparator()
                      .addItem("Список транзакций", "Ozon.trigger17")
                      .addSeparator()
                      .addItem("Финансовый отчёт", "Ozon.trigger6")
                      .addItem(
                        "Финансовый отчёт (расшифровка)",
                        "Ozon.trigger11"
                      )
                      .addSeparator()
                      .addItem("Отчёт о реализации", "Ozon.trigger7")
                      .addItem("Данные аналитики", "Ozon.trigger5")
                      .addSeparator()
                      .addItem("Отчёт по товарам", "Ozon.trigger8")
                      .addItem("Остатки FBO/FBS", "Ozon.trigger1")
                      .addItem("Остатки FBO", "Ozon.trigger18")
                      .addItem(
                        "Отчёт по остаткам и товарам FBO",
                        "Ozon.trigger9"
                      )
                      .addSeparator()
                      .addItem("Цены", "Ozon.trigger13")
                      .addItem("Цены (всё)", "Ozon.trigger16")
                  )
                  .addSeparator()
                  .addSubMenu(
                    ui
                      .createMenu("Performance API")
                      .addItem(
                        "✅ Подключить (блок ниже)",
                        "Ozon.triggerPerformance"
                      )
                      .addSeparator()
                      .addItem("РК Список", "Ozon.triggerPerformance1")
                      .addItem("РК По расходу", "Ozon.triggerPerformance2")
                      .addItem(
                        "РК Дневная статистика",
                        "Ozon.triggerPerformance3"
                      )
                      .addSeparator()
                      .addItem(
                        "РК Статистика (Трафареты)",
                        "Ozon.triggerPerformance4"
                      )
                      .addItem(
                        "РК Статистика (Поисковая промо)",
                        "Ozon.triggerPerformance5"
                      )
                  )
                  .addSeparator()
                  .addItem("❌ Удалить все", "Ozon.deleteTriggers")
              )
              .addSeparator()
              .addItem("🅰️ Текущая версия", "Ozon.ozonLibraryVersion")
              .addSeparator()
              .addItem("📄 Очистка перед выгрузкой", "Ozon.clearReportSheets")
              .addItem("📄 Очистить активный лист", "Ozon.clear")
              .addSeparator()
              .addItem(
                "📑 Копировать активный лист в...",
                "Ozon.copyActiveSheet"
              )
          );

        if (moysklad) {
          menu = this.moysklad(menu, ui);
        }

        menu.addToUi();
      },
      orders() {
        var ui = SpreadsheetApp.getUi();
        ui.createMenu(`${this.title}`)
          .addItem("⚠️ К сборке, сегодня + 1д", "ToAssembly_2")
          .addItem("🔄 К сборке все", "ToAssembly_1")
          .addSeparator()
          .addItem("1️⃣ Добавить в сборку", "AddAndSetInShip")
          .addItem("2️⃣ Сохранить экземпляры", "ProductExemplarSet")
          .addSeparator()
          .addItem("⛔️ Ждем 1 минуту...", "Ozon.emtyMenu")
          .addSeparator()
          .addItem("3️⃣ Проверить статус экземпляров", "ProductExemplarStatus")
          .addItem("4️⃣ Собрать заказы", "ShipOrders")
          .addSeparator()
          .addItem("👍 Готовые", "DoneList")
          .addItem("💾 Этикетки PDF", "CreateLabels")
          .addItem("📑 Ссылка на этикетки PDF", "CreateLabelsUrl")
          .addSeparator()
          .addItem("📝 Все готовые", "DoneListAll")
          .addSeparator()
          .addItem("✅ Отметить чекбоксы", "Ozon.setCheck")
          .addItem("⏹ Снять чекбоксы", "Ozon.unCheck")
          .addSeparator()
          .addSubMenu(
            ui
              .createMenu("⚙️ Настройки")
              .addItem("🔑 Seller API", "ozonSetSellerAccess")
              .addSeparator()
              .addItem("📁 Добавить папку", "ozonSetFolder")
          )
          .addToUi();
      },
      supply() {
        var ui = SpreadsheetApp.getUi();
        ui.createMenu(`${this.title}`)
          .addItem("⚙️ Поставки FBO выбрать статусы...", "Ozon.emtyMenu")
          .addItem("1️⃣ Информация о заявке на поставку", "fboSupplyOrderList")
          .addItem("⚙️ Поставки FBO выбрать заявки...", "Ozon.emtyMenu")
          .addItem(
            "2️⃣ Состав поставки или заявки на поставку",
            "fboSupplyOrderBundle"
          )
          .addSeparator()
          .addItem("Количество заявок по статусам", "fboSupplyOrderCount")
          .addSeparator()
          .addItem("Загруженность складов FBO", "warehousesAvailable")
          .addSeparator()
          .addItem("Кластеры FBO", "fboClusterList")
          .addSeparator()
          .addSubMenu(
            ui
              .createMenu("Остатки, товары")
              .addItem("📘 Отчёт по товарам", "reportProducts")
              .addItem("📷 Фото товаров", "productsPhoto")
              .addSeparator()
              .addItem("Остатки по FBO", "stocksFbo")
              .addItem(
                "Отчёт по остаткам и товарам FBO (будет отключён, используйте Аналитика по остаткам FBO)",
                "analyticsStockOnWarehousesReport"
              )
              .addItem("Аналитика по остаткам FBO", "analyticsStocks")
          )
          .addSeparator()
          .addSubMenu(
            ui
              .createMenu("⚙️ Настройки")
              .addItem("🔑 Seller API", "ozonSetSellerAccess")
          )
          .addToUi();
      },
      labels() {
        var ui = SpreadsheetApp.getUi();
        ui.createMenu(`${this.title}`)
          .addItem("👍 Готовые", "DoneList")
          .addItem("💾 Этикетки PDF", "CreateLabels")
          .addItem("📑 Ссылка на этикетки PDF", "CreateLabelsUrl")
          .addSeparator()
          .addItem("📝 Все готовые", "DoneListAll")
          .addSeparator()
          .addSubMenu(
            ui
              .createMenu("⚙️ Настройки")
              .addItem("🔑 Seller API", "ozonSetSellerAccess")
              .addSeparator()
              .addItem("📁 Добавить папку", "ozonSetFolder")
              .addSeparator()
              .addItem("🅰️ Текущая версия", "Ozon.ozonLibraryVersion")
          )
          .addToUi();
      },
      prices() {
        var ui = SpreadsheetApp.getUi();
        ui.createMenu(`${this.title}`)
          .addItem("⬇️ Цены для обновления", "pricesUpdateInfo")
          .addItem("🔄 Обновить цены", "pricesUpdate")
          .addSeparator()
          .addItem("✅ Автоприменение акций", "setAutoActionEnabled")
          .addItem("❌ Автоприменение акций", "setAutoActionDisabled")
          .addSeparator()
          .addItem("✅ Автодобавление в акции Ozon", "setAutoActionOzonEnabled")
          .addItem(
            "❌ Автодобавление в акции Ozon",
            "setAutoActionOzonDisabled"
          )
          .addSeparator()
          .addItem(
            "✅ Автоприменение стратегий цены",
            "setPriceStrategyEnabled"
          )
          .addItem(
            "❌ Автоприменение стратегий цены",
            "setPriceStrategyDisabled"
          )
          .addSeparator()
          .addItem("Цены", "prices")
          .addItem("Цены (всё)", "pricesFull")
          .addSeparator()
          .addItem("Отчёт по товарам", "reportProducts")
          .addItem("Фото товаров", "productsPhoto")
          .addSeparator()
          .addSubMenu(
            ui
              .createMenu("⚙️ Настройки")
              .addItem("🔑 Seller API", "ozonSetSellerAccess")
              .addSeparator()
              .addItem("🅰️ Текущая версия", "Ozon.ozonLibraryVersion")
          )
          .addToUi();
      },
      stocks_prices() {
        var ui = SpreadsheetApp.getUi();
        ui.createMenu(`${this.title}`)
          .addSubMenu(
            ui
              .createMenu("Остатки (FBS и rFBS)")
              .addItem("⬇️ Остатки для обновления", "stocksByWarehouseFbs")
              .addSeparator()
              .addItem(
                "🔄 Обновить остатки (по складам)",
                "stocksUpdateByWarehousesFbs"
              )
              .addSeparator()
              .addItem("📝 Cписок складов FBS", "wherehouses")
          )
          .addSeparator()
          .addSubMenu(
            ui
              .createMenu("Цены")
              .addItem("⬇️ Цены для обновления", "pricesUpdateInfo")
              .addSeparator()
              .addItem("🔄 Обновить цены", "pricesUpdate")
              .addSeparator()
              .addItem("✅ Автоприменение акций", "setAutoActionEnabled")
              .addItem("❌ Автоприменение акций", "setAutoActionDisabled")
              .addSeparator()
              .addItem(
                "✅ Автодобавление в акции Ozon",
                "setAutoActionOzonEnabled"
              )
              .addItem(
                "❌ Автодобавление в акции Ozon",
                "setAutoActionOzonDisabled"
              )
              .addSeparator()
              .addItem(
                "✅ Автоприменение стратегий цены",
                "setPriceStrategyEnabled"
              )
              .addItem(
                "❌ Автоприменение стратегий цены",
                "setPriceStrategyDisabled"
              )
              .addSeparator()
              .addItem("Цены", "prices")
              .addItem("Цены (всё)", "pricesFull")
          )
          .addSeparator()
          .addItem("Отчёт по товарам", "reportProducts")
          .addItem("Фото товаров", "productsPhoto")
          .addSeparator()
          .addSubMenu(
            ui
              .createMenu("⚙️ Настройки")
              .addItem("🔑 Seller API", "ozonSetSellerAccess")
              .addSeparator()
              .addItem("🅰️ Текущая версия", "Ozon.ozonLibraryVersion")
          )
          .addToUi();
      },
      actions() {
        var ui = SpreadsheetApp.getUi();
        ui.createMenu(`${this.title}`)
          .addSubMenu(
            ui
              .createMenu("Акции")
              .addItem("1️⃣ Список акций", "actionsList")
              .addItem(
                "2️⃣ Список доступных для акции товаров",
                "actionsCandidates"
              )
              .addItem("3️⃣ Список товаров в акциях", "actionsProducts")
              .addSeparator()
              .addItem("✅ Добавить в акции", "actionsActivate")
              .addItem("❌ Удалить из акций", "actionsDeactivate")
          )
          .addSeparator()
          .addSubMenu(
            ui
              .createMenu("Заявки на скидку")
              .addItem(
                "Список заявок на скидку (новые)",
                "actionDiscountsTaskListNew"
              )
              .addItem(
                "Список заявок на скидку (просмотренные)",
                "actionDiscountsTaskListSeen"
              )
              // .addItem(
              //   "Список заявок на скидку (все)",
              //   "actionDiscountsTaskList"
              // )
              .addSeparator()
              .addItem("✅ Согласовать", "actionDiscountsTaskApprove")
              .addItem("❌ Отклонить", "actionDiscountsTaskDecline")
          )
          .addSeparator()
          .addItem("📘 Отчёт по товарам", "reportProducts")
          .addItem("📷 Фото товаров", "productsPhoto")
          .addItem("💵 Цены (всё)", "pricesFull")
          .addSeparator()
          .addSubMenu(
            ui
              .createMenu("⚙️ Настройки")
              .addItem("🔑 Seller API", "ozonSetSellerAccess")
          )
          .addToUi();
      },
      chat() {
        var ui = SpreadsheetApp.getUi();
        ui.createMenu(`${this.title}`)
          .addItem("Список чатов", "chatList")
          .addItem("История чата", "chatHistory")
          .addItem("Отправить сообщение в чат", "chatSendMessage")
          .addSubMenu(
            ui
              .createMenu("⚙️ Настройки")
              .addItem("🔑 Seller API", "ozonSetSellerAccess")
              .addSeparator()
              .addItem("🅰️ Текущая версия", "Ozon.ozonLibraryVersion")
          )
          .addToUi();
      },
      reviews() {
        var ui = SpreadsheetApp.getUi();
        ui.createMenu(`${this.title}`)
          .addItem("Отзывов по статусам", "rewiewsCount")
          .addItem("Список отзывов", "rewiewsList")

          .addItem("Отправить сообщение в чат", "chatSendMessage")
          .addSubMenu(
            ui
              .createMenu("⚙️ Настройки")
              .addItem("🔑 Seller API", "ozonSetSellerAccess")
              .addSeparator()
              .addItem("🅰️ Текущая версия", "Ozon.ozonLibraryVersion")
          )
          .addToUi();
      },
      moysklad(menu, ui) {
        return menu
          .addSeparator()
          .addSubMenu(
            ui
              .createMenu("МойСклад")
              .addItem("📄 Ассортимнет", "moyskladAssortment")
              .addItem("📦 Остатки", "moyskladStocks")
              .addItem("📦 Остатки по складам", "moyskladStocksByStores")
              .addSeparator()
              .addSubMenu(
                ui
                  .createMenu("⚙️ Настройки")
                  .addItem("🔑 Токен", "moyskladSetToken")
              )
              .addSeparator()
              .addSubMenu(
                ui
                  .createMenu("⏳ Автообновление")
                  .addItem("Ассортимнет", "Ozon.triggerMoysklad1")
                  .addItem("Остатки", "Ozon.triggerMoysklad2")
                  .addItem("Остатки по складам", "Ozon.triggerMoysklad3")
              )
          );
      },
    },
    func: {
      start: () => {
        return new Date().getTime();
      },

      end: (s) => {
        const e = new Date().getTime();
        return e - s;
      },

      endScript: ({
        script,
        start,
        error = null,
        sheet,
        func,
        clear = false,
        emptyCols = true,
        emptyRows = true,
        setFilter = true,
        autoResize = false,
        removeDuplicates = false,
        message,
        messageType = 1,
        scipError = false,
      }) => {
        let e;
        try {
          if (sheet) {
            const filter = sheet.getFilter();
            const lastRow = sheet.getLastRow();
            const lastColumn = sheet.getLastColumn();
            const maxRows = sheet.getMaxRows();
            const maxColumns = sheet.getMaxColumns();
            const sheetName = sheet.getName();

            if (filter) filter.remove();

            if (clear) sheet.clear();

            if (func) func();

            // SpreadsheetApp.flush();

            if (removeDuplicates) removeDuplicatesByColNative(sheet, 1);

            if (emptyCols && emptyRows && lastRow > 1 && lastColumn > 1) {
              cropToRange(sheet.getDataRange());
            }

            if (
              emptyCols &&
              !emptyRows &&
              maxColumns > lastColumn &&
              lastColumn > 1
            ) {
              removeEmptyColumns(sheet);
            }

            if (emptyRows && !emptyCols && maxRows > lastRow && lastRow > 1)
              removeEmptyRows(sheet);

            if (setFilter && lastRow > 1)
              sheet.getRange(1, 1, lastRow, maxColumns).createFilter();

            if (autoResize) sheet.autoResizeColumns(1, maxColumns);

            if (!message && messageType === 1)
              ss.toast(`[INFO] ${sheetName} обновили`, "✅ SUCCESS", 7);

            if (message && messageType === 2)
              ss.toast(`[WARNING] ${message} ${sheetName}`, "⚠️ ATTENTION", 7);
          }

          if (message && messageType === 1)
            ss.toast(`[INFO] ${message}`, "✅ SUCCESS", 7);

          if (!sheet && message && messageType === 2)
            ss.toast(`[INFO] ${message}`, "⚠️ ATTENTION", 7);

          if (error && !scipError) {
            console.log(error.stack);
            SpreadsheetApp.getUi().alert(
              `⚠️ ATTENTION`,
              error.stack,
              SpreadsheetApp.getUi().ButtonSet.OK
            );
          }
        } catch (e) {
          return e;
        } finally {
          const time_end = CONFIG.func.end(start);
          const err = error ? error : e;

          // if (err) console.log(err?.stack);

          const stopPattern =
            /Unauthorized|Forbidden|Not Found|В результате этого действия количество ячеек в книге превысит максимально допустимое (10000000)|Service Spreadsheets failed while accessing document with id|Служба была вызвана слишком много раз за день: urlfetch./i;

          if (err && stopPattern.test(err?.message)) {
            const user = ss.getOwner().getEmail();

            // console.log(
            //   Session.getActiveUser().getEmail(),
            //   ss.getOwner().getEmail()
            // );

            const subject = "⚠️ Ошибка выполнения скрипта Ozon";
            const autoanswer =
              "<br><hr><h3><em><strong>Пожалуйста, не отвечайте на это письмо, оно сгенерировано автоматически.</strong></em></h3>";

            const message = {
              to: user,
              name: "Automatic Emailer Script",
              subject,
              htmlBody:
                "<b>Сообщени об ошибке.</b><br><br>Файл: " +
                ss.getUrl() +
                "<br><br>Ошибка:\n" +
                err.stack +
                autoanswer,
            };

            return MailApp.sendEmail(message);
          } else {
            return loock(script, time_end, err);
          }
        }
      },
    },
  };
})();

function emtyMenu() {
  return;
}

function setStorage({
  service,
  serviceName = "Ozon",
  serviceType = "getScriptProperties",
}) {
  if (!context?.storage)
    return new StorageService({
      service,
      serviceName,
      serviceType,
    });
}

function init(tableContext, options = {}) {
  if (!tableContext) {
    tableContext = context?.this_;
  }

  const service = tableContext?.PropertiesService;
  Object.assign(context, { ...options, this_: tableContext, service });

  // Объединяем дефолтные значения с переданными
  const defaultOptions = {
    serviceName: "Ozon",
    serviceType: "getScriptProperties",
  };

  const finalOptions = { ...defaultOptions, ...options };

  if (!context?.storage) {
    context.storage = new StorageService({
      service,
      ...finalOptions,
    });
  }

  return context;
}

/**
 * Sets the library version in a specified range on a spreadsheet.
 *
 * @return {void} This function does not return anything.
 */
function ozonLibraryVersion() {
  const { libraryVersion, libraryVersionRange, sheetSettings } =
    CONFIG.settings;
  setSheet(sheetSettings)
    .getRange(libraryVersionRange)
    .setValue(`Версия: ${libraryVersion}`);
}

// ####################################################################################################################################
// ПЕРЕМЕННЫЕ ДАТЫ И ВРЕМЕНИ
// ####################################################################################################################################

const dateTimeNow = CONFIG.settings.time.now;
const tzoffset = new Date().getTimezoneOffset() * 60000; // offset in milliseconds

// const filterDateFromStartYearMsc = new Date(
//   new Date(dateTimeNow.getFullYear(), 0, 1, 0, 0, 0) - tzoffset
// ).toISOString();

const filterDateFromStartYearMsc = new Date(
  Date.UTC(dateTimeNow.getFullYear(), 0, 1)
).toISOString();

// const filterDateFromStartYear = new Date(
//   new Date(dateTimeNow.getFullYear(), 0, 1, 0, 0, 0) // - tzoffset
// ).toISOString();
// .slice(0, -1);

const filterDateFromStartYear = new Date(
  Date.UTC(dateTimeNow.getFullYear(), 0, 1) + tzoffset
).toISOString();

const filterDateEndStartYear = new Date(
  new Date(dateTimeNow.getFullYear(), 11, 31, 23, 59, 59, 999)
).toISOString();

const filterDateFromStartMonth = new Date(
  new Date(dateTimeNow.getFullYear(), dateTimeNow.getMonth(), 1, 0, 0, 0)
).toISOString();

const filterDateFromEndMonth = new Date(
  new Date(dateTimeNow.getFullYear(), dateTimeNow.getMonth() + 1, 0, 0, 0, 0, 0)
).toISOString();

const filterDateFromStartLastMonth = new Date(
  new Date(dateTimeNow.getFullYear(), dateTimeNow.getMonth() - 1, 1, 0, 0, 0, 0)
).toISOString();

const filterDateCutoffTo = new Date(
  new Date(
    dateTimeNow.getFullYear(),
    dateTimeNow.getMonth(),
    dateTimeNow.getDate() + 1,
    13,
    0,
    0,
    0
  )
).toISOString(); // 13:00 МСК UTC-0

const filterDateCutoffToMsc = new Date(
  new Date(
    dateTimeNow.getFullYear(),
    dateTimeNow.getMonth(),
    dateTimeNow.getDate() + 1,
    13,
    0,
    0,
    0
  ) - tzoffset
).toISOString(); // 13:00 МСК UTC+3

const filterDateYesterdayStart = new Date(
  new Date(
    dateTimeNow.getFullYear(),
    dateTimeNow.getMonth(),
    dateTimeNow.getDate() - 1,
    0,
    0,
    0,
    0
  )
).toISOString();

const filterDateYesterdayEnd = new Date(
  new Date(
    dateTimeNow.getFullYear(),
    dateTimeNow.getMonth(),
    dateTimeNow.getDate() - 1,
    23,
    59,
    59,
    999
  )
).toISOString();

const filterDateTwoDaysAgoEnd = new Date(
  new Date(
    dateTimeNow.getFullYear(),
    dateTimeNow.getMonth(),
    dateTimeNow.getDate() - 2,
    23,
    59,
    59,
    999
  )
).toISOString();

const filterDateToday = new Date(new Date().setHours(0, 0, 0, 0)).toISOString();
const filterDateTodayEnd = new Date(
  new Date().setHours(23, 59, 59, 999)
).toISOString();

const filterDateTomorrow = new Date(
  new Date(
    dateTimeNow.getFullYear(),
    dateTimeNow.getMonth(),
    dateTimeNow.getDate() + 1,
    23,
    59,
    59,
    999
  )
).toISOString();

const filterDateToNow = new Date(Date.now()).toISOString();

const countMinusDay = 90; // Кол-во дней для обновления
const minusDay = new Date(new Date() - countMinusDay * 24 * 60 * 60 * 1000); // Минус дней
const filterDatefinanceTransactionListFromOld = new Date(
  new Date(
    minusDay.getFullYear(),
    minusDay.getMonth(),
    minusDay.getDate(),
    0,
    0,
    0
  )
).toISOString();

const filterDatefinanceTransactionListFrom2023 = new Date(
  new Date(2023, 0, 1, 0, 0, 0)
).toISOString();

const filterDatefinanceTransactionListFrom = new Date(
  new Date(dateTimeNow.getFullYear(), dateTimeNow.getMonth(), 1, 0, 0, 0, 0) -
    tzoffset
).toISOString();

const filterDatefinanceTransactionListFromEndMonth = new Date(
  new Date(dateTimeNow.getFullYear(), dateTimeNow.getMonth() + 1, 0, 0, 0, 0) -
    tzoffset
).toISOString();

function filterDateFromIf({
  sh,
  range,
  days = 1,
  offsettz = false,
  iso = true,
  yyyymmdd = false,
}) {
  const lastRow = sh && sh.getLastRow() > 0 ? sh.getLastRow() : null;

  if (lastRow) {
    const dates = sh
      .getRange(range + lastRow)
      .getValues()
      .flat();

    if (dates && dates.length) {
      // const sorted = dates
      //   .slice()
      //   .sort((a, b) => new Date(a) - new Date(b))
      //   .pop();

      const sorted = dates.sort((a, b) => new Date(a) - new Date(b)).pop();
      console.log(sorted);

      const minus = days ? days * 24 * 60 * 60 * 1000 : 0;
      const tz = offsettz ? tzoffset : 0;
      const dateFrom = new Date(
        new Date(sorted).setHours(0, 0, 0, 0) - minus - tz
      );
      const dateToEnd = new Date(
        new Date(sorted).setHours(23, 59, 59, 999) - minus - tz
      );

      const result = {
        dateFrom: iso ? dateFrom.toISOString() : dateFrom,
        dateTo: filterDateYesterdayEnd,
        dateToEnd: iso ? dateToEnd.toISOString() : dateToEnd,
      };

      if (yyyymmdd) {
        result.dateFrom = Utilities.formatDate(
          dateFrom,
          "GMT+03:00",
          "yyyy-MM-dd"
        );
        result.dateToEnd = Utilities.formatDate(
          dateToEnd,
          "GMT+03:00",
          "yyyy-MM-dd"
        );
      }
      return result;
    }
  }
}

// Начальная дата для выгрузки
const dateFrom2004 = Utilities.formatDate(
  new Date(2004, 0, 1, 0, 0, 0),
  "Europe/Moscow",
  "yyyy-MM-dd"
);
// Начальная дата для выгрузки
const dateFrom2024 = Utilities.formatDate(
  new Date(2024, 0, 1, 0, 0, 0),
  "Europe/Moscow",
  "yyyy-MM-dd"
);
// Начальная дата для выгрузки
const dateFrom2023 = Utilities.formatDate(
  new Date(2024, 0, 1, 0, 0, 0),
  "Europe/Moscow",
  "yyyy-MM-dd"
);
